<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML
><HEAD
><TITLE
>PA-RISC/Linux Boot HOWTO</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.7"><META
NAME="KEYWORD"
CONTENT="PA-RISC"><META
NAME="KEYWORD"
CONTENT="Linux"><META
NAME="KEYWORD"
CONTENT="boot"><link rel="stylesheet" href="../bookstyle.css"></HEAD
><BODY
CLASS="book"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="BOOK"
><A
NAME="AEN1"
></A
><DIV
CLASS="TITLEPAGE"
><H1
CLASS="title"
><A
NAME="AEN2"
></A
>PA-RISC/Linux Boot HOWTO</H1
><H3
CLASS="author"
><A
NAME="AEN5"
></A
>Thomas Marteau</H3
><DIV
CLASS="affiliation"
><SPAN
CLASS="orgname"
>TuxFamily<BR></SPAN
><DIV
CLASS="address"
><P
CLASS="address"
><br>
				<TT
CLASS="email"
>&#60;<A
HREF="mailto:marteaut@tuxfamily.org"
>marteaut@tuxfamily.org</A
>&#62;</TT
><br>
			&nbsp;&nbsp;</P
></DIV
></DIV
><H3
CLASS="author"
><A
NAME="AEN12"
></A
>Deb Richardson</H3
><DIV
CLASS="affiliation"
><SPAN
CLASS="orgname"
>The Puffin Group<BR></SPAN
><DIV
CLASS="address"
><P
CLASS="address"
><br>
				<TT
CLASS="email"
>&#60;<A
HREF="mailto:deb@thepuffingroup.com"
>deb@thepuffingroup.com</A
>&#62;</TT
><br>
			&nbsp;&nbsp;</P
></DIV
></DIV
><H3
CLASS="author"
><A
NAME="AEN19"
></A
>Thibaut Varène</H3
><DIV
CLASS="affiliation"
><SPAN
CLASS="orgname"
>PA/Team<BR></SPAN
><DIV
CLASS="address"
><P
CLASS="address"
><br>
				<TT
CLASS="email"
>&#60;<A
HREF="mailto:T-Bone@parisc-linux.org"
>T-Bone@parisc-linux.org</A
>&#62;</TT
><br>
			&nbsp;&nbsp;</P
></DIV
></DIV
><P
CLASS="edition"
>version 1.5 for DocBook V4.2&nbsp;Edition </P
><P
CLASS="copyright"
>Copyright &copy; 1999 The Puffin Group and Deb Richardson.</P
><P
CLASS="copyright"
>Copyright &copy; 2001, 2002, 2003 Thomas Marteau.</P
><P
CLASS="copyright"
>Copyright &copy; 2002, 2003, 2006 Thibaut Varène.</P
><P
CLASS="pubdate"
>2006-06-06<BR></P
><DIV
CLASS="revhistory"
><TABLE
WIDTH="100%"
BORDER="0"
><TR
><TH
ALIGN="LEFT"
VALIGN="TOP"
COLSPAN="3"
><B
>Revision History</B
></TH
></TR
><TR
><TD
ALIGN="LEFT"
>Revision 1.5</TD
><TD
ALIGN="LEFT"
>2006-06-06</TD
><TD
ALIGN="LEFT"
>Revised by: tv</TD
></TR
><TR
><TD
ALIGN="LEFT"
COLSPAN="3"
>XML cleanup, improved and reorganized contents. Updated to palo 1.5+ and kernel 2.6.</TD
></TR
><TR
><TD
ALIGN="LEFT"
>Revision 1.1</TD
><TD
ALIGN="LEFT"
>2003-11-01</TD
><TD
ALIGN="LEFT"
>Revised by: tm</TD
></TR
><TR
><TD
ALIGN="LEFT"
COLSPAN="3"
>Added Jeremy Drake's <SPAN
CLASS="trademark"
>Windows</SPAN
>&#8482; server boot howto.</TD
></TR
><TR
><TD
ALIGN="LEFT"
>Revision 1.0</TD
><TD
ALIGN="LEFT"
>2002-10-04</TD
><TD
ALIGN="LEFT"
>Revised by: tm &#38; tv</TD
></TR
><TR
><TD
ALIGN="LEFT"
COLSPAN="3"
>Content done by Thibaut. Ready for Woody release. Added Glossary and bibliography. XML conversion.</TD
></TR
><TR
><TD
ALIGN="LEFT"
>Revision 0.9</TD
><TD
ALIGN="LEFT"
>2002-01-15</TD
><TD
ALIGN="LEFT"
>Revised by: tm</TD
></TR
><TR
><TD
ALIGN="LEFT"
COLSPAN="3"
>This version brings you some useful advices for compiling your own kernel on hppa systems.</TD
></TR
><TR
><TD
ALIGN="LEFT"
>Revision 0.8</TD
><TD
ALIGN="LEFT"
>2001-10-17</TD
><TD
ALIGN="LEFT"
>Revised by: tm</TD
></TR
><TR
><TD
ALIGN="LEFT"
COLSPAN="3"
>This version takes care of the change of name of the official FTP and CVS sites and modify the license.</TD
></TR
><TR
><TD
ALIGN="LEFT"
>Revision 0.7</TD
><TD
ALIGN="LEFT"
>2001-10-13</TD
><TD
ALIGN="LEFT"
>Revised by: tm</TD
></TR
><TR
><TD
ALIGN="LEFT"
COLSPAN="3"
>This version adds some updates due to the progress of PA/Linux.</TD
></TR
><TR
><TD
ALIGN="LEFT"
>Revision 0.6 draft</TD
><TD
ALIGN="LEFT"
>2001-09-26</TD
><TD
ALIGN="LEFT"
>Revised by: tm</TD
></TR
><TR
><TD
ALIGN="LEFT"
COLSPAN="3"
>This version contains some minor changes and complete the "obtaining bootp/tftpd" section.</TD
></TR
><TR
><TD
ALIGN="LEFT"
>Revision 0.5 draft</TD
><TD
ALIGN="LEFT"
>2001-07-03</TD
><TD
ALIGN="LEFT"
>Revised by: tm</TD
></TR
><TR
><TD
ALIGN="LEFT"
COLSPAN="3"
>This version is a large update from Deb's work.</TD
></TR
><TR
><TD
ALIGN="LEFT"
>Revision 0.3 draft</TD
><TD
ALIGN="LEFT"
>1999-11-24</TD
><TD
ALIGN="LEFT"
>Revised by: dlr</TD
></TR
><TR
><TD
ALIGN="LEFT"
COLSPAN="3"
>The initial and published version of this HOWTO.</TD
></TR
></TABLE
></DIV
><DIV
><DIV
CLASS="abstract"
><A
NAME="AEN49"
></A
><P
></P
><P
>This document outlines the procedures to get the PA-RISC/Linux
				kernel to boot on your PA-RISC system. It also explains the usage of <B
CLASS="command"
>PALO</B
>,
				the kernel loader for PA/Linux. You will find much information on how to
				compile a kernel from the source available at
				<A
HREF="http://cvs.parisc-linux.org/"
TARGET="_top"
>http://cvs.parisc-linux.org/</A
>.
				Please note that this HOWTO version is newer than Deb Richardson's and
				includes more accurate information because of the progress of the port.
				Nevertheless, it's worth mentioning that this document kept parts of Deb's
				original work and unveiled some remarkable information.</P
><P
>If you are looking for information related to HP
				hardware but not directly to PA-RISC, please read
				<A
HREF="http://www.tldp.org/HOWTO/HP-HOWTO/"
TARGET="_top"
>Bruno
				Cornec's HP-HOWTO</A
>.</P
><P
>Note: by the time this HOWTO was started, Debian was the only Linux
				distribution available for the PA-RISC platform, hence the "Debian
				color" of this document. Some times, Debian specific commands
				will have to be replaced by their equivalent, if any.</P
><P
></P
></DIV
></DIV
><DIV
CLASS="legalnotice"
><A
NAME="AEN39"
></A
><P
></P
><P
>&#13;				Permission is granted to copy, distribute and/or modify this
				document under the terms of the GNU Free Documentation
				License, Version 1.2 as published by the
				Free Software Foundation; with no Invariant Sections, with
				no Front-Cover Texts, and with no Back-Cover Texts.
				A copy of the license can be found at
				<A
HREF="http://www.gnu.org/copyleft/fdl.html"
TARGET="_top"
>http://www.gnu.org/copyleft/fdl.html</A
>.
			</P
><P
></P
></DIV
><DIV
CLASS="legalnotice"
><A
NAME="AEN42"
></A
><P
></P
><P
>No liability for the contents of this document can be accepted.
				Use the concepts, examples and information at your own risk.
				There may be errors and inaccuracies, that could be damaging
				to your system. Proceed with caution, and although it is highly
				unlikely that accidents will happen because of following advice
				or procedures described in this document, the author(s) do not
				take any responsibility for any damage claimed to be caused by
				doing so.
		  </P
><P
>All copyrights are held by their by their respective owners,
				unless specifically noted otherwise. Use of a term in this
				document should not be regarded as affecting the validity of
				any trademark or service mark. Naming of particular products or
				brands should not be seen as endorsements.
		  </P
><P
></P
></DIV
><HR></DIV
><DIV
CLASS="TOC"
><DL
><DT
><B
>Table of Contents</B
></DT
><DT
><A
HREF="#introduction"
>Introduction</A
></DT
><DT
>1. <A
HREF="#hardware"
>Supported Hardware</A
></DT
><DT
>2. <A
HREF="#preparation"
>Preparing to boot</A
></DT
><DD
><DL
><DT
>2.1. <A
HREF="#bootadmin"
><B
CLASS="command"
>BOOT_ADMIN</B
></A
></DT
><DT
>2.2. <A
HREF="#consoles"
>Consoles</A
></DT
></DL
></DD
><DT
>3. <A
HREF="#palo"
><B
CLASS="command"
>PALO</B
>, the PA/Linux kernel loader</A
></DT
><DD
><DL
><DT
>3.1. <A
HREF="#whatispalo"
>What is <B
CLASS="command"
>PALO</B
>?</A
></DT
><DT
>3.2. <A
HREF="#whatdoespalo"
>What does <B
CLASS="command"
>PALO</B
>?</A
></DT
><DT
>3.3. <A
HREF="#paloappusage"
><B
CLASS="command"
>PALO</B
> management tool usage</A
></DT
><DT
>3.4. <A
HREF="#paloearlyboot"
>How to use <B
CLASS="command"
>PALO</B
> at early boot stage?</A
></DT
></DL
></DD
><DT
>4. <A
HREF="#bootsolutions"
>Available boot solutions</A
></DT
><DD
><DL
><DT
>4.1. <A
HREF="#bootcd"
>Booting from CD</A
></DT
><DT
>4.2. <A
HREF="#boothd"
>Booting from hard drive</A
></DT
><DT
>4.3. <A
HREF="#bootnetwork"
>Booting from network</A
></DT
></DL
></DD
><DT
>5. <A
HREF="#vmlinux"
>Building and installing a custom kernel</A
></DT
><DD
><DL
><DT
>5.1. <A
HREF="#gcc"
>GCC compiler</A
></DT
><DT
>5.2. <A
HREF="#kernelconf"
>Kernel configuration</A
></DT
><DT
>5.3. <A
HREF="#kernelinstall"
>Kernel installation</A
></DT
></DL
></DD
><DT
>A. <A
HREF="#win2kdhcp"
><SPAN
CLASS="trademark"
>Windows</SPAN
>&#8482; 2003 boot server howto</A
></DT
><DD
><DL
><DT
>A.1. <A
HREF="#win2ksetupdhcp"
>Setup the DHCP service</A
></DT
><DT
>A.2. <A
HREF="#win2ksetuptftp"
>Get &#38; setup the TFTP server</A
></DT
><DT
>A.3. <A
HREF="#tryw2k"
>Attempt to netboot</A
></DT
></DL
></DD
><DT
>B. <A
HREF="#oldpalo"
>Older <B
CLASS="command"
>PALO</B
> dumps</A
></DT
><DD
><DL
><DT
>B.1. <A
HREF="#oldpaloa500"
>A500 Session dump using <B
CLASS="command"
>PALO</B
> 0.97</A
></DT
></DL
></DD
><DT
>C. <A
HREF="#contributors"
>HOWTO contributors</A
></DT
><DT
><A
HREF="#gloss"
>Glossary</A
></DT
><DT
><A
HREF="#biblio"
>Bibliography</A
></DT
></DL
></DIV
><DIV
CLASS="preface"
><HR><H1
><A
NAME="introduction"
></A
>Introduction</H1
><P
>You just received this PA-RISC box you bought online, or maybe you
				got it from your company scrapyard. Anyway, here comes the question of the
				operating system you are going to use. The PA/Linux project consists in porting
				Linux to the PA-RISC architecture, and we hope that if you decide to use it on
				your box, this HOWTO will help you in the process of setting it up.</P
><P
>In addition to porting the Linux kernel, the development team is working
				on porting the Debian project to PA-RISC. In fact, by the time we wrote this
				document, over 97% of the package pool is available for the stable
				Debian release (3.1, aka <EM
>Sarge</EM
>) on hppa (see
				<A
HREF="http://buildd.debian.org/stats/hppa.txt"
TARGET="_top"
>the buildd stats</A
>
				for detailed data). Some Debian developers and users reported that the
				port was one of the easiest to install, as it feels like installing an
				i386 system.</P
><P
>For more information about the PA-RISC/Linux porting project,
				please see <A
HREF="http://www.parisc-linux.org/"
TARGET="_top"
>http://www.parisc-linux.org/</A
>, or a mirror site like
				<A
HREF="http://www.fr.parisc-linux.org/"
TARGET="_top"
>http://www.fr.parisc-linux.org/</A
>.
				This site deals with kernel development and improvement. For user-space
				troubles, please refer to
				<A
HREF="http://www.debian.org/ports/hppa/"
TARGET="_top"
>Debian hppa port pages</A
>.</P
><P
>In a few words, this HOWTO is aimed at anyone looking for some
				help and information about using Linux on a PA-RISC system. No particular prior
				knowledge is necessary but bases about how Debian packages work, and general
				background about Linux can be helpful.</P
><P
>It is also worth mentioning that some sections of the present document
				aren't Linux-centric, and may be of use to people dealing with other OSes,
				such as BSDs or even HP-UX.</P
><P
>After listing supported hardware, this HOWTO explains some commands
				of the Boot Console Handler (<SPAN
CLASS="acronym"
>BCH</SPAN
>) available at boot time. Then, the
				features of the PA/Linux kernel loader are introduced in another chapter,
				and finally many ways to get your system up and running are detailed.
				At the end, the text goes deep in the kernel compilation and configuration,
				as well as a few appendices giving some extra hints.</P
></DIV
><DIV
CLASS="chapter"
><HR><H1
><A
NAME="hardware"
></A
>Chapter 1. Supported Hardware</H1
><P
>With the release of PA-RISC architecture in Debian 3.0
			(aka <EM
>Woody</EM
>), a major improvement was
			made in term of quantity and quality of hardware support.
			Since 0.9.3 released<A
NAME="AEN123"
HREF="#FTN.AEN123"
><SPAN
CLASS="footnote"
>[1]</SPAN
></A
>, the kernel has been
			greatly improved, so that much unsupported hardware by the time 0.9.3 went out
			is now handled. That's why even if your model is not listed here, you might
			give it a try and report your result to the mailing list:
			<TT
CLASS="email"
>&#60;<A
HREF="mailto:parisc-linux@lists.parisc-linux.org"
>parisc-linux@lists.parisc-linux.org</A
>&#62;</TT
>.
		</P
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>Mind that as of this document's publication date, the 2.4 series of the
			Linux kernel are deemed obsolete, and no development happens in that branch.
			Any new comer to the PA-RISC/Linux port should look at the 2.6 kernel series,
			which supports much more hardware than the 2.4 does. Accordingly, one will not try
			to use the now aging <EM
>Woody</EM
> release and will instead focus
			on its successor: <EM
>Sarge</EM
>, or even better, the upcoming 
			<EM
>Etch</EM
>.</P
></TD
></TR
></TABLE
></DIV
><P
>The following PA-RISC machines should work just fine, provided that you follow the
			instructions of the present document.
			Please note that this list can change at any time.
			The best way to get an up to date version is to look at
			<A
HREF="http://www.pateam.org/list.html"
TARGET="_top"
>http://www.pateam.org/list.html</A
>.
			This is the place to find relevant information about a specific model,
			including special boot procedures.
			More hardware information can be found on <A
HREF="http://www.openpa.net/"
TARGET="_top"
>OpenPA</A
>.
		</P
><P
>&#13;			SMP machines should work with SMP kernels (and UP ones, of course) unless stated otherwise.
		</P
><P
></P
><UL
><LI
><P
>All 712 models.</P
></LI
><LI
><P
>All 715 models including Strider series.</P
></LI
><LI
><P
>All 705, 710, 720, 730, 750 models should work.</P
></LI
><LI
><P
>Some 725, 735 (no HVD SCSI), 755 models are now working.
					But since there was not a lot of feedback about these machines, we can not be
					more explicit.</P
></LI
><LI
><P
>The VME-like systems are supported. This includes 742 and 743.</P
></LI
><LI
><P
>A180 and similar.</P
></LI
><LI
><P
>A500, and similar (rp2400 series).</P
></LI
><LI
><P
>BXXX models like B132, B160 and B180. These boxes can be used in the
					framebuffer mode through the Standard Text Interface.</P
></LI
><LI
><P
>BXXXX models like B1000, B2000 and B2600. These boxes can be used with
					<TT
CLASS="literal"
>STI_CONSOLE</TT
>, but framebuffer only works with VIS-EG cards.
					FX adapters are not supported.</P
></LI
><LI
><P
>CXXX models like C100, C110, C160, C180, C200, C240, C360.</P
></LI
><LI
><P
>CXXXX models. Indeed, BXXXX and CXXXX are the same kind of machines,
					based on Astro/Elroy (aka SBA/LBA) chipsets with varying CPU speeds,
					number of memory/PCI slots. C3000, C3600, C3750 are reported to be working.</P
></LI
><LI
><P
>D class works unless you have a Remote Management Card installed. Even then,
					it still kind of works, it's just that ttyS0 gets assigned to the second
					serial port and you have to switch cables around.</P
></LI
><LI
><P
>J class is quite well supported. It has the same split as C class,
					<EM
>i.e.</EM
> JXXX and J2240 are U2/Uturn based and JXXXX are
					Astro/Elroy. It is the SMP version of CXXXX models.</P
></LI
><LI
><P
>K class is supported if you are using recent ISO images (<EM
>e.g.</EM
>
					Sarge ones).</P
></LI
><LI
><P
>L class and similar (rp5400 series).</P
></LI
><LI
><P
>N class: N4000 (some rp7400 series are reported to work).</P
></LI
><LI
><P
>R class is basically the same as D class.</P
></LI
></UL
><P
>&#13;			These are not really working yet but work is being carried on.
		</P
><P
></P
><UL
><LI
><P
>The current 8-way (and bigger) machines using SX1000 chipset and pa8800
					(or pa8900) processors do not work yet.  Similarly, smaller 2-socket and
					4-socket platforms using ZX1 chipset and pa8800 (or pa8900) such as rp3400 series do
					not work correctly yet either.</P
></LI
></UL
><P
>&#13;			No plan to get the following hardware completely supported in the near future:
		</P
><P
></P
><UL
><LI
><P
>E class: E35 and E55 are known to work diskless. The SCSI support is not expected
				to work anytime soon.</P
></LI
><LI
><P
>F,G,H,I classes: Currently not supported.</P
></LI
><LI
><P
>SuperDome: It boots "single-cell", multi-IOMMU doesn't work.</P
></LI
><LI
><P
>T 5XX and V class: Nobody is working on it at the moment.</P
></LI
><LI
><P
>rp8400: these are cell based and probably don't work yet.</P
></LI
></UL
><P
>&#13;			The following hardware might never work:
		</P
><P
></P
><UL
><LI
><P
>T600.</P
></LI
><LI
><P
>Vis-FX graphic adapters.</P
></LI
></UL
></DIV
><DIV
CLASS="chapter"
><HR><H1
><A
NAME="preparation"
></A
>Chapter 2. Preparing to boot</H1
><DIV
CLASS="highlights"
><A
NAME="AEN198"
></A
><P
>Like any other system, machines based on PA-RISC processors have to
			go through several steps in order to get Linux up and running. The next
			section introduces you to the early boot management of your PA-RISC computer.
			(By the way, to be a bit less awkward, we might from time to time call it a
			<EM
>'PA'</EM
> box). This chapter will give you some
			key concepts like <B
CLASS="command"
>BOOT_ADMIN</B
>.</P
></DIV
><DIV
CLASS="sect1"
><HR><H1
CLASS="sect1"
><A
NAME="bootadmin"
></A
>2.1. <B
CLASS="command"
>BOOT_ADMIN</B
></H1
><DIV
CLASS="highlights"
><A
NAME="AEN205"
></A
><P
>First of all, you must learn what is and how to use <B
CLASS="command"
>BOOT_ADMIN</B
> on your
				PA-RISC box, before thinking about doing anything with it.</P
></DIV
><P
><B
CLASS="command"
>BOOT_ADMIN</B
> is a <EM
>firmware</EM
> application,
				used to manage a PA-RISC machine at an early boot stage,
				<EM
>i.e.</EM
> when the box has not yet started its
				<EM
>Operating System</EM
>. It is also known as the
				<A
HREF="#glossbch"
><I
CLASS="glossterm"
>Boot Console Handler (<SPAN
CLASS="acronym"
>BCH</SPAN
>)</I
></A
>. Those familiar with the x86 world
				will probably see it as a kind of <EM
>BIOS</EM
>,
				whilst PPC fans might think of it as an equivalent for
				<EM
>Open Firmware</EM
>.</P
><P
>We named it <B
CLASS="command"
>BOOT_ADMIN</B
>
				throughout this document since it is the name it is the most common prompt it
				will display on
				most PA-RISC machines. You will see through this HOWTO that there
				are many references to it, therefore it's worth
				saying that minimalistic <B
CLASS="command"
>BOOT_ADMIN</B
> skills are mandatory!</P
><DIV
CLASS="sect2"
><HR><H2
CLASS="sect2"
><A
NAME="enterbootadmin"
></A
>2.1.1. Entering the <B
CLASS="command"
>BOOT_ADMIN</B
> interface</H2
><P
>Entering the <B
CLASS="command"
>BOOT_ADMIN</B
> management tool isn't that awful:</P
><P
></P
><OL
TYPE="1"
><LI
><P
>Turn your PA-RISC box on.</P
></LI
><LI
><P
>During the boot process, the following message will appear
							on the current <EM
>console</EM
> (see <A
HREF="#consoles"
>Section 2.2</A
>):
							<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
><TT
CLASS="computeroutput"
>&#13;Searching for Potential Boot Devices.
To terminate search, press and hold the ESCAPE key.
							</TT
></PRE
></FONT
></TD
></TR
></TABLE
>
							When this message is displayed, press and hold the <B
CLASS="keycap"
>Esc</B
> key
							until an option menu appears. This can take a while, be patient. On recent
							machines, pressing any key interrupts the boot process as well.</P
></LI
><LI
><P
>By default, you should enter the <B
CLASS="command"
>BOOT_ADMIN</B
> console.
							Though on some 715s and 725s, an option menu looking like this may be shown:
							<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
><TT
CLASS="computeroutput"
>&#13;b)    Boot from specified device
s)    Search for bootable devices
a)    Enter Boot Administration mode
x)    Exit and continue boot sequence
?)    Help

Select from menu:
							</TT
></PRE
></FONT
></TD
></TR
></TABLE
>
							Type '<B
CLASS="keycap"
>a</B
>' and hit <B
CLASS="keycap"
>Enter</B
> to enter
							Boot Administration mode. This will bring up a
							'<TT
CLASS="computeroutput"
>BOOT_ADMIN&#62;</TT
>' prompt.</P
></LI
></OL
><P
>Once you have the '<TT
CLASS="computeroutput"
>BOOT_ADMIN&#62;</TT
>'
					prompt, you can pat yourself on the back: you are in <B
CLASS="command"
>BOOT_ADMIN</B
> mode!</P
><P
>As it has been said before, the prompt can differ between machines. On recent ones,
					for instance, it looks like that:
					<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
><TT
CLASS="computeroutput"
>&#13;Main Menu: Enter command or menu &#62;
					</TT
></PRE
></FONT
></TD
></TR
></TABLE
>
				</P
></DIV
><DIV
CLASS="sect2"
><HR><H2
CLASS="sect2"
><A
NAME="bootadminhelp"
></A
>2.1.2. <B
CLASS="command"
>BOOT_ADMIN</B
> commands</H2
><P
><B
CLASS="command"
>BOOT_ADMIN</B
> is an early boot subsystem (a Boot Console Handler, as said before)
					where you can execute a limited set of commands. You should find here everything
					you need to know about them.</P
><P
>All HP-PA systems have a <SPAN
CLASS="acronym"
>BCH</SPAN
>. The display can be different but the idea remains the same.
					That's why the following list is not complete but consistent enough.
					Another important thing is that for each command, you have a shorter way
					to invoke it. You can see the shortcut shown as uppercase letters in
					the command name. Full names will be used in this section.</P
><DIV
CLASS="caution"
><P
></P
><TABLE
CLASS="caution"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/caution.gif"
HSPACE="5"
ALT="Caution"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>Be cautious when dealing with the <SPAN
CLASS="acronym"
>BCH</SPAN
>, you can harm your system.</P
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>Some commands may appear in several different menus, and all commands listed
						here may not necessarily be available on your particular system, this is normal.</P
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="sect3"
><HR><H3
CLASS="sect3"
><A
NAME="AEN260"
></A
>2.1.2.1. The <TT
CLASS="literal"
>main</TT
> commands</H3
><P
>These commands are the basic ones.</P
><P
></P
><UL
><LI
><P
><B
CLASS="command"
>boot</B
> may be followed by an argument
							which indicates the path you want to boot. The path should be
							the definition of a device like for example
							<TT
CLASS="computeroutput"
>FWSCSI.6.0</TT
> or
							<TT
CLASS="computeroutput"
>PRI</TT
> if you have set this
							variable correctly. Usually defaults to <TT
CLASS="computeroutput"
>PRI</TT
>.</P
></LI
><LI
><P
><B
CLASS="command"
>path</B
> displays or sets the current paths.
							Invoked with only one argument it will display the current path of the
							entity passed as argument: <B
CLASS="command"
>path alt</B
> will display the
							current alternative boot path. <B
CLASS="command"
>path pri fwscsi.6.0</B
> will
							setup the primary boot path as the device attached to Fast and Wide SCSI
							controller with ID 6 and LUN 0. You can also set and display the paths
							of console (graphics/serial) and keyboard (ps2/hil/usb).</P
></LI
><LI
><P
><B
CLASS="command"
>search</B
> is a very useful command.
							It automagically checks all possible boot devices and displays
							these bootable paths. In several firmware versions, it links them
							to a shortcut (like <TT
CLASS="computeroutput"
>P0</TT
>). It can even search
							the LAN, if the box is able to boot it. Some firmware revisions allow you
							to restrain the search path like: <B
CLASS="command"
>search lan</B
> or
							<B
CLASS="command"
>search disk</B
>.</P
></LI
><LI
><P
><B
CLASS="command"
>display</B
> redisplays the current menu.</P
></LI
><LI
><P
><B
CLASS="command"
>help</B
> gives you an overview of the
							available commands and their action. <B
CLASS="command"
>help <TT
CLASS="parameter"
><I
>name</I
></TT
>
							</B
> will give you details on command <TT
CLASS="parameter"
><I
>name</I
></TT
>.
							By default, you can list all <TT
CLASS="literal"
>main</TT
> commands by
							typing <B
CLASS="command"
>help main</B
>.</P
></LI
><LI
><P
><B
CLASS="command"
>main</B
> will bring you back to the
							<TT
CLASS="literal"
>main</TT
> menu, whatever menu you might be currently
							browsing.</P
></LI
><LI
><P
>On almost every systems, there is a
							<B
CLASS="command"
>reset</B
> instruction. It restarts the machine with
							the latest parameters you have set.</P
></LI
></UL
></DIV
><DIV
CLASS="sect3"
><HR><H3
CLASS="sect3"
><A
NAME="AEN300"
></A
>2.1.2.2. The <TT
CLASS="literal"
>configuration</TT
> commands</H3
><P
>These commands are available in the
						<TT
CLASS="computeroutput"
>configuration</TT
> menu. So, in order to use
						them, you must enter this menu by typing <B
CLASS="command"
>configuration</B
>
						at the '<TT
CLASS="computeroutput"
>BOOT_ADMIN&#62;</TT
>' prompt.</P
><P
></P
><UL
><LI
><P
><B
CLASS="command"
>auto</B
> will tell you if the box will automatically
							start booting when switched on, or will do a search for boot devices, depending
		      		on the first argument passed to the command (<TT
CLASS="parameter"
><I
>boot</I
></TT
>,
		      		<TT
CLASS="parameter"
><I
>search</I
></TT
>, <TT
CLASS="parameter"
><I
>start</I
></TT
>). You can modify this
		      		parameter with the keywords <TT
CLASS="parameter"
><I
>ON</I
></TT
> and <TT
CLASS="parameter"
><I
>OFF</I
></TT
>.</P
></LI
><LI
><P
><B
CLASS="command"
>default</B
> sets back the factory defaults.</P
></LI
><LI
><P
><B
CLASS="command"
>monitor</B
> (only in <A
HREF="#graphicsconsole"
>graphic
							console</A
>) sets your display configuration by typing <B
CLASS="command"
>monitor
			      	<TT
CLASS="replaceable"
><I
>&#60;path&#62;</I
></TT
> <TT
CLASS="replaceable"
><I
>&#60;type&#62;</I
></TT
></B
>
			      	which indicates your console path and type. You can list the available modes by typing
			      	<B
CLASS="command"
>monitor list</B
>.</P
></LI
><LI
><P
><B
CLASS="command"
>fastboot</B
> displays or sets the boot tests execution.</P
></LI
></UL
></DIV
><DIV
CLASS="sect3"
><HR><H3
CLASS="sect3"
><A
NAME="bootadminfo"
></A
>2.1.2.3. The <TT
CLASS="literal"
>information</TT
> commands</H3
><P
>They give you access to global information about your system.
						Going into this menu is done by asking for <B
CLASS="command"
>information</B
>.</P
><P
></P
><UL
><LI
><P
><B
CLASS="command"
>all</B
> should display everything.</P
></LI
><LI
><P
><B
CLASS="command"
>bootinfo</B
> lists all the boot parameters of the system.</P
></LI
><LI
><P
><B
CLASS="command"
>fwrversion</B
> gives your firmware revision.
							You can check if your firmware is up-to-date at
							<A
HREF="ftp://us-ffs.external.hp.com/firmware_patches/hp/cpu/catalog"
TARGET="_top"
>this
							webpage</A
>.</P
></LI
><LI
><P
><B
CLASS="command"
>lanaddress</B
> shows the MAC (Ethernet) address of the system.
							On some boxes (especially 712s), two different addresses may appear. The one you are
							looking for is the first.</P
></LI
></UL
></DIV
><DIV
CLASS="sect3"
><HR><H3
CLASS="sect3"
><A
NAME="AEN349"
></A
>2.1.2.4. The <TT
CLASS="literal"
>service</TT
> commands</H3
><DIV
CLASS="warning"
><P
></P
><TABLE
CLASS="warning"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/warning.gif"
HSPACE="5"
ALT="Warning"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>It is a PA-RISC guru menu.</P
></TD
></TR
></TABLE
></DIV
><P
>You will find nothing really interesting for an end-user here.
						We recommend you not to play with it unless you <EM
>really</EM
>
						know what you are doing.</P
><P
></P
><UL
><LI
><P
><B
CLASS="command"
>pim [&#60;proc&#62;] [HPMC|LPMC|TOC]</B
> displays the content
								of a <A
HREF="#glosspim"
><I
CLASS="glossterm"
>Processor Internal Memory (<SPAN
CLASS="acronym"
>PIM</SPAN
>)</I
></A
> and Error Log. It is very useful after a
								<A
HREF="#glosstoc"
><I
CLASS="glossterm"
>Transfer Of Control (<SPAN
CLASS="acronym"
>TOC</SPAN
>)</I
></A
> to collect debugging information.</P
></LI
><LI
><P
><B
CLASS="command"
>clearpim</B
> clears <A
HREF="#glosspim"
><I
CLASS="glossterm"
>Processor Internal Memory (<SPAN
CLASS="acronym"
>PIM</SPAN
>)</I
></A
> data.</P
></LI
><LI
><P
><B
CLASS="command"
>scroll</B
> enables or disables the scrolling mode in <B
CLASS="command"
>BOOT_ADMIN</B
>
			      		on recent boxes.</P
></LI
></UL
></DIV
></DIV
></DIV
><DIV
CLASS="sect1"
><HR><H1
CLASS="sect1"
><A
NAME="consoles"
></A
>2.2. Consoles</H1
><DIV
CLASS="highlights"
><A
NAME="AEN372"
></A
><P
>&#13;				Throughout your PA-RISC experience, you will be often told about
				<EM
>consoles</EM
>. This section aims at de-obfuscating what
				this word means and how to use said <EM
>consoles</EM
>.
			</P
></DIV
><P
>&#13;				In order to boot your PA-RISC system with the PA/Linux kernel,
				you must first set up a <EM
>console</EM
>.
				A <EM
>console</EM
> is basically the device where the kernel
				(and the firmware) will display its output, and where
				input can by sent to control the system at an early boot stage.
				You can use either <EM
>graphic console</EM
>, which requires
				having a monitor and a keyboard attached to the system,
				or <EM
>serial console</EM
>, which allows serial line
				communication between the system and another Linux machine,
				or any VT system.
		  </P
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>Please note that the firmware console and kernel console
				are not necessarily the same. For instance, it is possible to
				interact with <B
CLASS="command"
>BOOT_ADMIN</B
> using keyboard &#38; monitor, and once PA/Linux is up,
				to have kernel output sent to serial port only. By default,
				<A
HREF="#glosspalo"
><I
CLASS="glossterm"
>PA LOader (<SPAN
CLASS="acronym"
>PALO</SPAN
>)</I
></A
> will try to use firmware console as the
				kernel one.
		  </P
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="tip"
><P
></P
><TABLE
CLASS="tip"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/tip.gif"
HSPACE="5"
ALT="Tip"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;				Workstations usually boot in graphic mode, whereas servers
				boot in serial mode. Some boxes will also automatically switch
				to serial if no keyboard is connected, or if you hold down
				<TT
CLASS="literal"
>TOC</TT
> switch while powering the system on.
			</P
></TD
></TR
></TABLE
></DIV
><P
>&#13;				If you don't know what the actual console of your box is,
				it's quite simple: find the place where first output is sent when
				the box is turned on (serial line or monitor output, if any), that is
				the console.
		  </P
><P
>&#13;				If you are trying to setup a PA-RISC workstation and have a monitor handy,
				the easiest method is to use <EM
>graphic console</EM
>.
				If you get into troubles, or are trying to configure a server, choose
				<EM
>serial console</EM
>.
		  </P
><DIV
CLASS="sect2"
><HR><H2
CLASS="sect2"
><A
NAME="graphicsconsole"
></A
>2.2.1. Using graphic console</H2
><DIV
CLASS="caution"
><P
></P
><TABLE
CLASS="caution"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/caution.gif"
HSPACE="5"
ALT="Caution"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;					To use the graphic console, you must first ensure that
					the Linux kernel supports your system's graphic card.
				</P
></TD
></TR
></TABLE
></DIV
><P
>&#13;					There are two ways to deal with the graphic console.
					If you think about bug-reporting any trouble, you must know how to
					differentiate both. First, the <EM
>STI</EM
> console is
					the classical video text console, like <EM
>VGA</EM
> on a
					common PC for example. This name is due to the fact that each PA-RISC
					box with graphical capabilities features the <A
HREF="#glosssti"
><I
CLASS="glossterm"
>Standard Text Interface (<SPAN
CLASS="acronym"
>STI</SPAN
>)</I
></A
>
					which defines some standardized ways to access the video memory.
					The other graphic console is the well known
					<EM
>framebuffer</EM
> console (which on
					HP-PA uses STI in a special manner, hence the name
					<EM
>STIfb</EM
>). In this case, when booting,
					you will see a characteristic little penguin appearing on
					the top-left corner. This is the easiest way to differentiate
					the two graphic modes.
				</P
><P
>&#13;					Obviously, if you can use graphic console, it is the easiest way to proceed.
					Nevertheless, you must be sure that your hardware is supported.
				</P
><DIV
CLASS="important"
><P
></P
><TABLE
CLASS="important"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/important.gif"
HSPACE="5"
ALT="Important"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;					All HP-provided graphics cards can deal with <A
HREF="#glosssticon"
><I
CLASS="glossterm"
>Standard Text Interface Console layer (<SPAN
CLASS="acronym"
>STIcon</SPAN
>)</I
></A
>,
					but not all of them are <A
HREF="#glossstifb"
><I
CLASS="glossterm"
>Standard Text Interface FrameBuffer layer (<SPAN
CLASS="acronym"
>STIfb</SPAN
>)</I
></A
> supported in Linux.
					This is especially true for Vis-FX cards that can only be used through STIcon.
				</P
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="sect2"
><HR><H2
CLASS="sect2"
><A
NAME="serialconsole"
></A
>2.2.2. Using serial console</H2
><P
>&#13;					The serial console is a good way to obtain all console messages,
					including the <A
HREF="#glossbch"
><SPAN
CLASS="acronym"
>BCH</SPAN
></A
> ones.
					It is very useful for bug reports, as its output can be easily dumped.
					Moreover, most of the PA-RISC servers can only be managed with serial console.
				</P
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;					The only cases where serial console <EM
>HAS TO</EM
> be used is
					either if you don't have a monitor handy, or if the machine doesn't
					support graphics. It is also possible that the kernel can <EM
>NOT</EM
>
					handle some specific graphics hardware present in the machine, but that is
					pretty rare (<A
HREF="#glosssticon"
>STIcon</A
> should work everywhere).
				</P
></TD
></TR
></TABLE
></DIV
><P
>&#13;					Here is the procedure to setup serial console support.
				</P
><DIV
CLASS="sect3"
><HR><H3
CLASS="sect3"
><A
NAME="cable"
></A
>2.2.2.1. Serial Cable</H3
><P
>&#13;						To connect a PA-RISC machine to a PC's RS232 port, you need a
						9-pin-to-9-pin female plugs null-modem cable.
						You should be able to obtain such a cable at your local computer
						hardware reseller.
						Obviously, you can also choose to connect the other end of the
						cable to a terminal (in this case it will probably need
						a 25-pin male plug). Anyway, the most practical method is
						to connect it to another box running <B
CLASS="command"
>minicom</B
>
						or <B
CLASS="command"
>cu</B
>, which makes all output easily available for
						further usage (dump report, session log, and so on).
		  	  </P
></DIV
><DIV
CLASS="sect3"
><HR><H3
CLASS="sect3"
><A
NAME="minicom"
></A
>2.2.2.2. Configuring <B
CLASS="command"
>minicom</B
> on Linux</H3
><P
>&#13;						In order to communicate with a PA-RISC machine on a serial line,
						you have to set it up in serial console mode (see
						<A
HREF="#changingtoserial"
>below</A
>),
						and configure a serial communication program. We recommend
						<B
CLASS="command"
>minicom</B
>, which can be found in most
						Linux distributions. If you don't have <B
CLASS="command"
>minicom</B
>
						on your system, you can find the latest package on any major
						Linux software website.
		  	  </P
><P
>&#13;						Most of the <B
CLASS="command"
>minicom</B
> configuration is machine dependent.
						However, you must ensure that:
		  	  </P
><P
></P
><OL
TYPE="a"
><LI
><P
>The baud rate is set to 9600</P
></LI
><LI
><P
>Protocol is set to 8-N-1 (8bit data, No parity check, 1 stop bit)</P
></LI
></OL
><P
>&#13;						Don't worry too much as these are the default values on PA/Linux.
						If you are running <B
CLASS="command"
>minicom</B
> on a PC, you will
						probably need to change the baud rate.
		  	  </P
></DIV
></DIV
><DIV
CLASS="sect2"
><HR><H2
CLASS="sect2"
><A
NAME="switchingconsoles"
></A
>2.2.3. Switching consoles</H2
><P
>&#13;					It might prove useful that you learn how to manage the console mode on a PA-RISC box.
					The following section will explain the various operations regarding console modes.
				</P
><DIV
CLASS="sect3"
><HR><H3
CLASS="sect3"
><A
NAME="checkingcurrentmode"
></A
>2.2.3.1. Checking current console mode</H3
><P
>&#13;						Type: <B
CLASS="command"
>path console</B
> to see the current console mode.
				  </P
><P
>&#13;						If it's <EM
>graphic console</EM
> mode, it will return
						something like: '<TT
CLASS="computeroutput"
>Console path     = graphic_1</TT
>'.
				  </P
><P
>&#13;						If it's <EM
>serial console</EM
>, it will return:
						'<TT
CLASS="computeroutput"
>Console path    = rs232_a.9600.8.none</TT
>'
						or something similar.
		  	  </P
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;						On some models, there can be slight differences in the naming, but the idea stays
						the same. If you want to see more descriptions here, please send us a message describing
						the box you use and what you get.
					</P
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="sect3"
><HR><H3
CLASS="sect3"
><A
NAME="changingtoserial"
></A
>2.2.3.2. Changing to serial console mode</H3
><P
>&#13;						To change to serial console mode, type the following command at the
						'<TT
CLASS="computeroutput"
>BOOT_ADMIN&#62;</TT
>' command prompt:
		  	  </P
><P
>&#13;						<B
CLASS="command"
>path console rs232_a.9600.8.none</B
>
				  </P
><P
>or, like on B132L+</P
><P
>&#13;						<B
CLASS="command"
>path console serial_1</B
>
				  </P
><P
>&#13;						Anyway, on most boxes if you try to setup an invalid path for the console,
						you will be warned and prompted again for a valid path.
						To verify that the console path has been correctly set, type
						<B
CLASS="command"
>path console</B
>.  This should return something like
						'<TT
CLASS="computeroutput"
>Console path    = rs232_a.9600.8.none</TT
>',
						indicating that the system is now set up to boot using serial console,
						on RS232 port 'A'.
						If your machine has only one, this is OK, if not, take care to use the right one.
						<B
CLASS="command"
>reset</B
> will reboot your system with the new parameters.
		  	  </P
><DIV
CLASS="sect4"
><HR><H4
CLASS="sect4"
><A
NAME="serial712"
></A
>2.2.3.2.1. How can I change the boot console to serial on a 712?</H4
><P
>&#13;							Unfortunately, it is <EM
>*normally*</EM
> not possible.
							Although 712s are configured for in-house HP development to use serial,
							this cannot be set in <B
CLASS="command"
>BOOT_ADMIN</B
>. You will have to use graphic console on 712s.
							And why the hell would we use this beautiful 712 with serial console when
							we can have X on it?!
						</P
><P
>&#13;							Anyway, if you feel like trying bleeding edge solutions, there is a tip at the
							<A
HREF="http://lists.parisc-linux.org/pipermail/parisc-linux/1999-December/008117.html"
TARGET="_top"
>PA/Linux mailing list archive</A
>.
							This explains how to change the console from an <EM
>HP/UX
							<A
HREF="#glossisl"
>ISL</A
></EM
> prompt. Since you actually
							<EM
>need</EM
> HP/UX to be able to do the serial trick,
							you can find a small HP/UX <EM
>lifimage</EM
> here:
							<A
HREF="http://www.pateam.org/archive/uxbootlf"
TARGET="_top"
>http://www.pateam.org/archive/uxbootlf</A
>.
							(See further <A
HREF="#bootnetwork"
>Section 4.3</A
> to learn how to
							<EM
>netboot</EM
> a lifimage).
							In fact, serial console on 712 is especially useful if you want to boot the box
							without having a keyboard attached to it, which is otherwise not possible.
						</P
><DIV
CLASS="warning"
><P
></P
><TABLE
CLASS="warning"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/warning.gif"
HSPACE="5"
ALT="Warning"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;							The following takedown is highly unofficial, unsupported and in a general
							way a <EM
>bad idea</EM
>, as you can make your 712 unbootable,
							needing intervention from a HP-techie, if something goes wrong. Beware!
						</P
></TD
></TR
></TABLE
></DIV
><P
>&#13;							Here is the procedure:
						</P
><P
></P
><OL
TYPE="1"
><LI
><P
>&#13;									Turn the box on and when in <B
CLASS="command"
>BOOT_ADMIN</B
>, boot into <SPAN
CLASS="application"
>HP/UX ISL</SPAN
>.
									For example:
								</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
><TT
CLASS="computeroutput"
>&#13;BOOT_ADMIN&#62; boot lan isl
								</TT
></PRE
></FONT
></TD
></TR
></TABLE
></LI
><LI
><P
>&#13;									Once you get the '<TT
CLASS="computeroutput"
>ISL&#62;</TT
>' prompt,
									type the following:
								</P
><P
></P
><UL
><LI
><P
>Switching to serial: <B
CLASS="command"
>conspath 2/0/4.0x283</B
></P
></LI
><LI
><P
>Switching to graphic: <B
CLASS="command"
>conspath 1/0/0.0</B
></P
></LI
></UL
></LI
><LI
><P
>&#13;									Still at the '<TT
CLASS="computeroutput"
>ISL&#62;</TT
>' prompt,
									type <B
CLASS="command"
>disp</B
>, and check that console path is either
									'<TT
CLASS="computeroutput"
>(hex) 2/0/4.283.0.0.0.0.0</TT
>'
									for serial, or '<TT
CLASS="computeroutput"
>(hex) 1/0/0.0.0.0.0.0.0</TT
>'
									for graphic.
								</P
></LI
><LI
><P
>Power cycle the system to bring it up on the new console.</P
></LI
></OL
></DIV
></DIV
><DIV
CLASS="sect3"
><HR><H3
CLASS="sect3"
><A
NAME="changingtographic"
></A
>2.2.3.3. Changing to graphic console mode</H3
><P
>&#13;				  	This is the reverse of the previous operation.
						By checking your console path, you should see
						'<TT
CLASS="computeroutput"
>Console path    = rs232_a.9600.8.none</TT
>'.
						Now, you can switch to the graphic mode by issuing the following command at
						'<TT
CLASS="computeroutput"
>BOOT_ADMIN&#62;</TT
>' prompt:
					</P
><P
>&#13;						<B
CLASS="command"
>path console graphic_1</B
>
				  </P
><P
>&#13;						The actual <EM
>switch</EM
> will happen after a
						<B
CLASS="command"
>reset</B
>. If the monitor does not seem to
						work properly, try to press the <B
CLASS="keycap"
>Tab</B
> key
						(on the keyboard attached to the box of course)
						at the beginning of the boot sequence to change the resolution of the display.
						By pressing this key, the monitor resolution cycles from one to another.
					</P
><DIV
CLASS="tip"
><P
></P
><TABLE
CLASS="tip"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/tip.gif"
HSPACE="5"
ALT="Tip"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>Keep that in mind when changing monitors.</P
></TD
></TR
></TABLE
></DIV
></DIV
></DIV
></DIV
></DIV
><DIV
CLASS="chapter"
><HR><H1
><A
NAME="palo"
></A
>Chapter 3. <B
CLASS="command"
>PALO</B
>, the PA/Linux kernel loader</H1
><DIV
CLASS="sect1"
><H1
CLASS="sect1"
><A
NAME="whatispalo"
></A
>3.1. What is <B
CLASS="command"
>PALO</B
>?</H1
><DIV
CLASS="highlights"
><A
NAME="AEN529"
></A
><P
>&#13;				<B
CLASS="command"
>PALO</B
> is a set of two programs, a boot loader,
				which is loaded by the PA-RISC <EM
>firmware</EM
> into memory
				and then executed, and a boot media management tool, which
				prepares and updates bootable media such as hard disk drives.
			</P
></DIV
><P
>&#13;				The <B
CLASS="command"
>PALO</B
> boot loader executable is stored in a file called
				<TT
CLASS="filename"
>iplboot</TT
>. '<TT
CLASS="literal"
>IPL</TT
>' is HP
				jargon for <EM
>Initial Program Loader</EM
>
				(See <A
HREF="#glossipl"
>the glossary</A
>).

				The boot media management tool is called <B
CLASS="command"
>PALO</B
>, which
				stands for PA/Linux LOader, just as on x86 the boot media
				management tool is called <SPAN
CLASS="application"
>LILO</SPAN
>.
			</P
><P
>&#13;				Even though <B
CLASS="command"
>PALO</B
> is much alike <SPAN
CLASS="application"
>LILO</SPAN
>
				(both have a userland application and a boot loader executable),
				it's worth mentioning that <B
CLASS="command"
>PALO</B
> doesn't usually need to be called
				every time you build and install a new kernel, as
				<SPAN
CLASS="application"
>LILO</SPAN
> does<A
NAME="AEN546"
HREF="#FTN.AEN546"
><SPAN
CLASS="footnote"
>[2]</SPAN
></A
>.
			</P
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;				<B
CLASS="command"
>PALO</B
> is strongly related to PA/Linux development. Thus, several versions have
				been released. Some changes in the way <B
CLASS="command"
>make palo</B
> operates
				are explained by the author of <B
CLASS="command"
>PALO</B
>, <EM
>Paul Bame</EM
>, in this
				<A
HREF="http://lists.parisc-linux.org/hypermail/parisc-linux/9451.html"
TARGET="_top"
>mail</A
>.
			</P
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="sect1"
><HR><H1
CLASS="sect1"
><A
NAME="whatdoespalo"
></A
>3.2. What does <B
CLASS="command"
>PALO</B
>?</H1
><P
>&#13;				The main idea is to boot a kernel, passing it all needed parameters.
				This is what the <EM
>boot loader</EM
> part of <B
CLASS="command"
>PALO</B
> does
				(see <A
HREF="#paloearlyboot"
>Section 3.4</A
>).
				Once it has been called by the <EM
>firmware</EM
>,
				it will load the Linux Kernel in memory, passing to it the given
				arguments, and tell the processor to branch to its entry point.
				This will begin the execution of the kernel on the PA-RISC computer.
			</P
><P
>&#13;				The <B
CLASS="command"
>PALO</B
> management tool can transform the usual
				<TT
CLASS="filename"
>vmlinux</TT
> into a PA-RISC bootable
				<EM
>lifimage</EM
>, including or not
				<TT
CLASS="literal"
>RAMDISK</TT
> or <TT
CLASS="literal"
>NFSROOT</TT
> support.
				However, it can also make a hard disk drive bootable, specifying
				the console output and the root device.
				We are going to see all these points precisely.
			</P
><DIV
CLASS="important"
><P
></P
><TABLE
CLASS="important"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/important.gif"
HSPACE="5"
ALT="Important"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;				What must be kept in mind is that <TT
CLASS="filename"
>vmlinux</TT
>
				is the kernel alone, which is not bootable as is.
				It needs <B
CLASS="command"
>PALO</B
> to be turned into a bootable
				<TT
CLASS="filename"
>lifimage</TT
> for CD or network boot,
				or to be loaded at boot time from a prepared hard
				disk drive. Have a look at <A
HREF="#gloss"
><I
>Glossary</I
></A
> about these words.
				Quoting a well known PA/Linux hacker:
				<A
NAME="AEN578"
></A
><TABLE
BORDER="0"
WIDTH="100%"
CELLSPACING="0"
CELLPADDING="0"
CLASS="BLOCKQUOTE"
><TR
><TD
WIDTH="10%"
VALIGN="TOP"
>&nbsp;</TD
><TD
WIDTH="80%"
VALIGN="TOP"
><P
><EM
>&#13;					People often try to put a lifimage in /boot, or a vmlinux on the
					network boot server.
					</EM
></P
></TD
><TD
WIDTH="10%"
VALIGN="TOP"
>&nbsp;</TD
></TR
><TR
><TD
COLSPAN="2"
ALIGN="RIGHT"
VALIGN="TOP"
>--<SPAN
CLASS="attribution"
>Richard Hirst</SPAN
></TD
><TD
WIDTH="10%"
>&nbsp;</TD
></TR
></TABLE
>

				Which is obviously wrong.
			</P
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="sect1"
><HR><H1
CLASS="sect1"
><A
NAME="paloappusage"
></A
>3.3. <B
CLASS="command"
>PALO</B
> management tool usage</H1
><P
>&#13;				Here we will show what can be done with the <B
CLASS="command"
>PALO</B
> boot media
				management tool. For in-depth information about <B
CLASS="command"
>palo</B
>
				usage, we strongly advise you to take a look at <B
CLASS="command"
>PALO</B
>'s
				<TT
CLASS="filename"
>README</TT
> file, which can be found in
				<TT
CLASS="filename"
>palo/</TT
> directory on
				<A
HREF="http://cvs.parisc-linux.org/"
TARGET="_top"
>http://cvs.parisc-linux.org/</A
>.
			</P
><P
>&#13;				For the next two steps, you will need a compiler toolchain,
				see <A
HREF="#gcc"
>Section 5.1</A
>.
			</P
><DIV
CLASS="sect2"
><HR><H2
CLASS="sect2"
><A
NAME="lifimagewithramdisk"
></A
>3.3.1. Making a <TT
CLASS="filename"
>lifimage</TT
> with <TT
CLASS="literal"
>RAMDISK</TT
></H2
><P
>&#13;					First things first: when should you walk this way?
				</P
><P
>&#13;					At an earlier stage of the PA/Linux project, the <TT
CLASS="filename"
>lifimage</TT
>
					was very useful. In fact, simply putting this file in a boot server
					tree allows you to boot your PA box using the <B
CLASS="command"
>boot lan</B
>
					instruction without any further involvement
					(see <A
HREF="#bootnetwork"
>Section 4.3</A
>).

					The main advantage of a <TT
CLASS="literal"
>RAMDISK</TT
> is that it unpacks
					its own file system in RAM, and therefore is completely independent
					of the machine I/O capabilities (hard drives, etc). The main drawback
					is that you have to build your own <TT
CLASS="literal"
>RAMDISK</TT
> if
					you have memory constraints or need some customized files. Now, let's see
					how to obtain a <TT
CLASS="filename"
>lifimage</TT
> with <TT
CLASS="literal"
>RAMDISK</TT
>.
				</P
><P
>&#13;					We assume you got the latest source of the PA/Linux kernel tree
					(to which we'll refer below as the
					"<TT
CLASS="filename"
>linux/</TT
> directory"),
					and that you are somewhat familiar with kernel configuration. Check
					<A
HREF="#kernelconf"
>Section 5.2</A
> for PA-RISC specific options.

					Mainly, you will need a (cross-)compiler, the
					<TT
CLASS="filename"
>linux/</TT
> directory and the <B
CLASS="command"
>PALO</B
>
					package installed. If you do not have it, run as
					<EM
>root</EM
> <B
CLASS="command"
>apt-get install palo</B
>.
					Everything can also be found at
					<A
HREF="http://www.parisc-linux.org/"
TARGET="_top"
>http://www.parisc-linux.org/</A
>.

					Go through the kernel configuration step.
					Then, run <B
CLASS="command"
>make palo</B
> and if <B
CLASS="command"
>PALO</B
> is installed,
					the following message should appear at the end of the compilation:

					<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;A generic palo config file (./palo.conf) has been created for you.
You should check it and re-run "make palo".
WARNING: the "lifimage" file is now placed in this directory by default!
					</PRE
></FONT
></TD
></TR
></TABLE
>

					So, edit the <TT
CLASS="filename"
>palo.conf</TT
> file:
					<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;# This a generic Palo configuration file.  For more information about how
# it works try 'palo -?'.
#
# Most people using 'make palo' want a bootable file, usable for
# network or tape booting for example.
--init-tape=lifimage
--recoverykernel=vmlinux

########## Pick your ROOT here! ##########
# You need at least one 'root='!
#
# If you want a root ramdisk, use the next 2 lines
#   (Edit the ramdisk image name!!!!)
--ramdisk=ram-disk-image-file
--commandline=0/vmlinux HOME=/ root=/dev/ram initrd=0/ramdisk

# If you want NFS root, use the following command line (Edit the HOSTNAME!!!)
#--commandline=0/vmlinux HOME=/ root=/dev/nfs nfsroot=HOSTNAME ip=bootp

# If you have root on a disk partition, use this (Edit the partition name!!!)
#--commandline=0/vmlinux HOME=/ root=/dev/sda1
					</PRE
></FONT
></TD
></TR
></TABLE
>

					As you can see, the <TT
CLASS="literal"
>RAMDISK</TT
> mode is the default. The string
					<TT
CLASS="replaceable"
><I
>ram-disk-image-file</I
></TT
> should give to <B
CLASS="command"
>PALO</B
> the path
					of your <TT
CLASS="literal"
>RAMDISK</TT
> file.
					You shouldn't change anything else to this file.
					After editing <TT
CLASS="filename"
>palo.conf</TT
>, you can run
					<B
CLASS="command"
>make palo</B
> again. The result, a <TT
CLASS="filename"
>lifimage</TT
>
					file, is waiting for you in the <TT
CLASS="filename"
>linux/</TT
> directory.
				</P
></DIV
><DIV
CLASS="sect2"
><HR><H2
CLASS="sect2"
><A
NAME="lifimagewithnfsroot"
></A
>3.3.2. Making a <TT
CLASS="filename"
>lifimage</TT
> with <TT
CLASS="literal"
>NFSROOT</TT
></H2
><P
>&#13;					This method is widely used because the kernel and the file system
					are directly accessible on your boot server.
					It is also very easy to test a new kernel.
					You just have to generate the kernel and put it in the correct directory.
					When starting up, the PA box will boot the new kernel by typing <B
CLASS="command"
>boot lan</B
>
					in <B
CLASS="command"
>BOOT_ADMIN</B
>.
					Finally, it is the only way to go for systems which I/O devices are not supported
					(such as E class, by the writing of this document).
				</P
><P
>&#13;					Enabling <TT
CLASS="literal"
>NFSROOT</TT
> support is easier than
					<TT
CLASS="literal"
>RAMDISK</TT
>. You have to edit <TT
CLASS="filename"
>palo.conf</TT
>
					to specify the boot server IP address instead of the string
					<TT
CLASS="replaceable"
><I
>HOSTNAME</I
></TT
>.
					For instance, if your server has 10.10.10.2 as its IP address,
					then the <TT
CLASS="filename"
>palo.conf</TT
> file should contain:

					<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;# This a generic Palo configuration file.  For more information about how
# it works try 'palo -?'.
#
# Most people using 'make palo' want a bootable file, usable for
# network or tape booting for example.
--init-tape=lifimage
--recoverykernel=vmlinux

########## Pick your ROOT here! ##########
# You need at least one 'root='!
#
# If you want a root ramdisk, use the next 2 lines
#   (Edit the ramdisk image name!!!!)
#--ramdisk=ram-disk-image-file
#--commandline=0/vmlinux HOME=/ root=/dev/ram initrd=0/ramdisk

# If you want NFS root, use the following command line (Edit the HOSTNAME!!!)
--commandline=0/vmlinux HOME=/ root=/dev/nfs nfsroot=10.10.10.2 ip=bootp

# If you have root on a disk partition, use this (Edit the partition name!!!)
#--commandline=0/vmlinux HOME=/ root=/dev/sda1
					</PRE
></FONT
></TD
></TR
></TABLE
>

					If you have another IP, this field must be filled in with the correct data.
					You shouldn't change anything else to this file.
					After having properly configured <TT
CLASS="filename"
>palo.conf</TT
>,
					you can go into the <TT
CLASS="filename"
>linux/</TT
>
					directory and issue a <B
CLASS="command"
>make palo</B
>.
					The result, a <TT
CLASS="filename"
>lifimage</TT
> file, is as usual waiting for
					you in the <TT
CLASS="filename"
>linux/</TT
> directory.
				</P
><P
>&#13;					For advanced details on <TT
CLASS="literal"
>NFSROOT</TT
> management, take a look
					at <A
HREF="#biblio"
><I
>Bibliography</I
></A
> for the appropriate HOWTOs.
				</P
></DIV
><DIV
CLASS="sect2"
><HR><H2
CLASS="sect2"
><A
NAME="bootablepartition"
></A
>3.3.3. Making a bootable partition</H2
><DIV
CLASS="highlights"
><A
NAME="AEN652"
></A
><P
>&#13;					In this part, <B
CLASS="command"
>PALO</B
> can be seen as a <SPAN
CLASS="application"
>LILO</SPAN
> clone.
					<B
CLASS="command"
>palo</B
> is mainly a program that enables a PA box to boot
					a kernel present on its hard disk drive.
					This section is going to explain how to make it work.
				</P
></DIV
><P
>&#13;					After installing the <B
CLASS="command"
>PALO</B
> package, a copy of the default
					<TT
CLASS="filename"
>palo.conf</TT
> can be found at
					<TT
CLASS="filename"
>/usr/share/doc/palo/palo.conf</TT
>. We will explain here
					how to customize it to fit your needs.
				</P
><P
>&#13;					To setup a bootable hard disk, you have to partition it properly
					(that is, if you want to use it as your primary boot device).
					This implies that this step can only be achieved either if you have already
					booted a minimal system on your PA-RISC box (from CD or network,
					see <A
HREF="#bootsolutions"
>Chapter 4</A
>), or if you intend to prepare your hard
					disk using another computer than the target one (which can be useful to unpack
					and setup a downloaded file system for a slow box, for example).
					The point of this HOWTO is not to teach you how to use <B
CLASS="command"
>fdisk</B
>
					and friends, so here are the few things you HAVE TO know:
				</P
><P
></P
><UL
><LI
><P
>&#13;							A partition entirely contained within the first 2GB of your target device has
							to be of partition type '<TT
CLASS="computeroutput"
>f0</TT
>',
							which is the reserved partition type for <B
CLASS="command"
>PALO</B
> boot loader.
						</P
></LI
><LI
><P
>&#13;							There are two ways to use <B
CLASS="command"
>PALO</B
>: the old scheme (available on all versions),
							in which that partition will only store configuration and recovery kernel;
							and the new scheme (available since <B
CLASS="command"
>PALO</B
> 1.5), in which that partition will
							be formatted as ext2 or ext3 and mounted in <TT
CLASS="filename"
>/boot</TT
>.
						</P
></LI
><LI
><P
>&#13;							In the first case, the partition does not need to be huge. This is were <B
CLASS="command"
>PALO</B
>
							will save its configuration, recovery kernel(s) - about 5MB each - and optional
							recovery ramdisk, so 32MB seem far sufficient.
						</P
></LI
><LI
><P
>&#13;							Alternatively, in the second case, since you will use it as
							<TT
CLASS="filename"
>/boot</TT
>, you should size it decently.
							100MB is a good cut.
						</P
></LI
></UL
><DIV
CLASS="warning"
><P
></P
><TABLE
CLASS="warning"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/warning.gif"
HSPACE="5"
ALT="Warning"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;					Beware! The <TT
CLASS="filename"
>vmlinux</TT
> file that will be actually booted
					has also to be located within the first 2GB of the hard disk.
					We strongly recommend to either (in the <EM
>old</EM
> scheme) create
					a separate <TT
CLASS="filename"
>/boot</TT
> partition at the beginning
					of the disk (unless you plan to boot recovery kernels every time), or use the
					<EM
>new</EM
> scheme and mount the <B
CLASS="command"
>PALO</B
> partition as
					<TT
CLASS="filename"
>/boot</TT
>, because if ever your vmlinux binary
					gets physically stored past the first 2GB of the disk
					(like when filling up '/' with data), the box won't boot anymore.
				</P
></TD
></TR
></TABLE
></DIV
><P
>&#13;						In fact, this third usage of <B
CLASS="command"
>PALO</B
> is the most common as the default
						<TT
CLASS="filename"
>/etc/palo.conf</TT
> makes it easy to configure.
				</P
><DIV
CLASS="sect3"
><HR><H3
CLASS="sect3"
><A
NAME="palooldscheme"
></A
>3.3.3.1. The old scheme: hidden partition</H3
><DIV
CLASS="highlights"
><A
NAME="AEN693"
></A
><P
>&#13;						The hidden partition is deprecated. Don't use this for a new setup. Use the
						new scheme instead (see <A
HREF="#palonewscheme"
>Section 3.3.3.2</A
>).
						The hidden partition method is documented for the sake of posterity.
					</P
></DIV
><P
>&#13;						Here is the output of <B
CLASS="command"
>fdisk</B
> which represents
						the hard drive of a box with 16MB <B
CLASS="command"
>PALO</B
> space, 128MB swap space
						and about 1GB '<TT
CLASS="literal"
>/</TT
>' partition:
					</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
><TT
CLASS="computeroutput"
>&#13;bash# fdisk -l /dev/sda

Disk /dev/sda: 133 heads, 62 sectors, 1017 cylinders
Units = cylinders of 8246 * 512 bytes

	 Device Boot    Start       End    Blocks   Id  System
/dev/sda1   *         1         4     16461   f0  Linux/PA-RISC boot
/dev/sda2             5        34    123690   82  Linux swap
/dev/sda3            35       277   1001889   83  Linux
					</TT
></PRE
></FONT
></TD
></TR
></TABLE
><P
>&#13;						Now let's deal with <B
CLASS="command"
>PALO</B
> configuration.
						Here are the various parameters you can change:
					</P
><P
></P
><UL
><LI
><P
><TT
CLASS="parameter"
><I
>recoverykernel</I
></TT
> is (as the name suggests)
								the path to the kernel you want to boot within a failsafe session,
								it will be stored in the '<TT
CLASS="literal"
>f0</TT
>-type' partition.
							</P
></LI
><LI
><P
><TT
CLASS="parameter"
><I
>bootloader</I
></TT
> is the path
								to the <TT
CLASS="filename"
>iplboot</TT
> boot loader utility which is
								created by <B
CLASS="command"
>PALO</B
> when you issue a <B
CLASS="command"
>make iplboot</B
>.</P
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>Usually you don't want to change or even specify this.</P
></TD
></TR
></TABLE
></DIV
></LI
><LI
><P
><TT
CLASS="parameter"
><I
>init-partitioned</I
></TT
> is used
								to indicate the pre-partionned device where palo will write its
								boot parameters. The effect is immediate. It means that <B
CLASS="command"
>PALO</B
> is
								going to write on (and erase the content of) the '<TT
CLASS="literal"
>f0</TT
>'
								partition of this device, which has to exist.
							</P
></LI
><LI
><P
><TT
CLASS="parameter"
><I
>commandline</I
></TT
>:
								the first digit is the number of your ext2/ext3 partition where the
								kernel file is located, as reported by <B
CLASS="command"
>fdisk</B
>.
								Logically, the next string is the absolute path to the kernel
								<EM
>from the root of THIS partition</EM
>
								<A
NAME="kpath"
HREF="#FTN.kpath"
><SPAN
CLASS="footnote"
>[3]</SPAN
></A
>.
								The following space separated parameters (do NOT use any quotation
								mark!) will be passed to the kernel as its arguments. <EM
>e.g.</EM
>:
								<TT
CLASS="literal"
>HOME=</TT
> and <TT
CLASS="literal"
>TERM=</TT
> are
								environmental parameters passed to <B
CLASS="command"
>init</B
>
								when booting. They are not compulsory but they can be useful.
								<TT
CLASS="literal"
>root=</TT
> tells the kernel which partition it
								must mount as the root file system while booting. It can be
								tricky when you have more than one disk, and is a mandatory
								argument. Maximum length for the commandline is 127 characters.
							</P
><P
>&#13;								You can also add <TT
CLASS="literal"
>console=</TT
>,
								to force the designation of the output console.
								You should remember that <TT
CLASS="literal"
>console=ttyS0</TT
> is for
								a serial console and <TT
CLASS="literal"
>console=tty0</TT
> is for a
								STI (graphic) console. Support for the <SPAN
CLASS="acronym"
>MUX</SPAN
>
								console (if enabled in the kernel, see <A
HREF="#kernelconf"
>Section 5.2</A
>)
								has been added, using <TT
CLASS="literal"
>console=ttyB0</TT
>.
								Recent versions of <B
CLASS="command"
>PALO</B
> auto detect the right console path
								(except for <SPAN
CLASS="acronym"
>MUX</SPAN
>), and can figure out whether
								a 32bit or 64bit kernel should be used. If not, please mail
								to the mailing list. Last but not least, if you are using
								Debian 2.6 kernels, you will also need to add
								<TT
CLASS="literal"
>initrd=X/path/to/initrd</TT
>, following the same
								rules as for the kernel path<A
HREF="#FTN.kpath"
><SPAN
CLASS="footnote"
>[3]</SPAN
></A
>, see above.
							</P
></LI
></UL
><P
>&#13;						According the above <B
CLASS="command"
>fdisk</B
> example, we want to use
						<TT
CLASS="filename"
>/dev/sda3</TT
> as our root partition. Thus,
						the configuration file should look like that:

						<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;# The following arguments are set up for booting from /dev/sda, specifically
# mounting partition 3 as root, and using /boot/vmlinux as both the
# recovery kernel, and the default dynamically-booted kernel.
--recoverykernel=/boot/vmlinux
--init-partitioned=/dev/sda
--commandline=3/boot/vmlinux root=/dev/sda3
						</PRE
></FONT
></TD
></TR
></TABLE
>

					</P
></DIV
><DIV
CLASS="sect3"
><HR><H3
CLASS="sect3"
><A
NAME="palonewscheme"
></A
>3.3.3.2. The new scheme: mounted partition</H3
><DIV
CLASS="highlights"
><A
NAME="AEN756"
></A
><P
>&#13;						Following is a practical example using the new way of doing things, by using a
						formatted <B
CLASS="command"
>PALO</B
> partition. That scheme should be the preferred one for new installations.
					</P
></DIV
><P
>&#13;						Looking at the previous example (<A
HREF="#palooldscheme"
>Section 3.3.3.1</A
>), very little things
						need to be changed. Essentially, if you had the need for a separate <TT
CLASS="filename"
>/boot</TT
> partition, it will be gone in the scheme detailed
						below. The configuration for <B
CLASS="command"
>PALO</B
> will be a little bit different as well, but that's
						about it.
					</P
><P
>&#13;						Here is the output of <B
CLASS="command"
>fdisk</B
> which represents
						the hard drive of a box with 100MB <B
CLASS="command"
>PALO</B
> space (which will be mounted as <TT
CLASS="filename"
>/boot</TT
>), 128MB swap space
						and about 1GB '<TT
CLASS="literal"
>/</TT
>' partition (bear in mind that the
						<TT
CLASS="literal"
>f0</TT
> partition must still be wholy contained within the first 2GB
						of the disk):
					</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
><TT
CLASS="computeroutput"
>&#13;bash# fdisk -l /dev/sda

Disk /dev/sda: 133 heads, 62 sectors, 1017 cylinders
Units = cylinders of 8246 * 512 bytes

	 Device Boot    Start       End    Blocks   Id  System
/dev/sda1   *         1        26    100461   f0  Linux/PA-RISC boot
/dev/sda2            27        36    123690   82  Linux swap
/dev/sda3            37       277    917889   83  Linux
					</TT
></PRE
></FONT
></TD
></TR
></TABLE
><P
>&#13;						Now let's deal with <B
CLASS="command"
>PALO</B
> configuration. Contrary to the previous example, there
						are far less options to put in the configuration file, and the setup is a single step
						operation: the <EM
>initialization</EM
> step, which needs only to be done
						once.
					</P
><P
>&#13;						To initialize for the first time the <B
CLASS="command"
>PALO</B
> partition as something the Linux system
						can understand (<TT
CLASS="literal"
>ext2</TT
> or <TT
CLASS="literal"
>ext3</TT
> filesystem), you need
						to run the following command (as <TT
CLASS="literal"
>root</TT
>):
					</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;<TT
CLASS="prompt"
>[user@machine ~/dir]&#62;</TT
> <B
CLASS="command"
>palo</B
> <TT
CLASS="userinput"
><B
>--format-as=<TT
CLASS="replaceable"
><I
>N</I
></TT
> --init-partitioned=<TT
CLASS="replaceable"
><I
>target_disk</I
></TT
></B
></TT
>
					</PRE
></FONT
></TD
></TR
></TABLE
><P
>&#13;						Where <TT
CLASS="replaceable"
><I
>N</I
></TT
> is either <TT
CLASS="literal"
>2</TT
> for <TT
CLASS="literal"
>ext2</TT
>
						or <TT
CLASS="literal"
>3</TT
> for <TT
CLASS="literal"
>ext3</TT
>, and <TT
CLASS="replaceable"
><I
>target_disk</I
></TT
>
						is the device which contains the <B
CLASS="command"
>PALO</B
> partition, <TT
CLASS="filename"
>/dev/sda</TT
>
						in the current example. Continuing with this example, assuming we want an <TT
CLASS="literal"
>ext3</TT
>
						partition we would use:
					</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;<TT
CLASS="prompt"
>[user@machine ~/dir]&#62;</TT
> <B
CLASS="command"
>palo</B
> <TT
CLASS="userinput"
><B
>--format-as=3 --init-partitioned=/dev/sda</B
></TT
>
					</PRE
></FONT
></TD
></TR
></TABLE
><DIV
CLASS="warning"
><P
></P
><TABLE
CLASS="warning"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/warning.gif"
HSPACE="5"
ALT="Warning"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;						Do <EM
>NOT</EM
> use <B
CLASS="command"
>mkfs</B
> or <B
CLASS="command"
>mke2fs</B
>
						to generate the filesystem on this partition. <B
CLASS="command"
>PALO</B
> marks blocks as used where the boot loader
						portion of <B
CLASS="command"
>PALO</B
> is stored on disk. These tools don't know about <B
CLASS="command"
>PALO</B
> boot loader!
					</P
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;						This needs to be run only once for it will erase any existing data on the 
						<TT
CLASS="literal"
>f0</TT
> partition.
					</P
></TD
></TR
></TABLE
></DIV
><P
>&#13;						Finally, we need to tell <B
CLASS="command"
>PALO</B
> about the partition, how we want it to be used, and
						how we don't want it to be erased everytime <B
CLASS="command"
>PALO</B
> is being run. Thus, keeping in sync
						with our current example,
						the configuration file should look like that:

						<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;# The following arguments are set up for booting from /dev/sda, specifically
# mounting partition 3 as root and booting the vmlinux file in /dev/sda1, palo
# partition formatted as ext3.
--update-partitioned=/dev/sda --format-as=3
--commandline=1/vmlinux root=/dev/sda3
						</PRE
></FONT
></TD
></TR
></TABLE
>

					</P
><P
>&#13;						As one can see, since we will be storing our kernels directly on the <TT
CLASS="literal"
>f0</TT
>
						partition, we tell <B
CLASS="command"
>PALO</B
> to load them from it (hence the <TT
CLASS="literal"
>1</TT
> in the
						<TT
CLASS="literal"
>commandline</TT
> argument.
					</P
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;						In the previous section (<A
HREF="#palooldscheme"
>Section 3.3.3.1</A
>) we dealt with the
						<TT
CLASS="parameter"
><I
>init-partitioned</I
></TT
> parameter. Here, we use
						<TT
CLASS="parameter"
><I
>update-partitioned</I
></TT
> instead, which, contrary to the former,
						tells <B
CLASS="command"
>PALO</B
> to not erase the content of the partition when run<A
NAME="AEN825"
HREF="#FTN.AEN825"
><SPAN
CLASS="footnote"
>[4]</SPAN
></A
>.
					</P
></TD
></TR
></TABLE
></DIV
></DIV
></DIV
></DIV
><DIV
CLASS="sect1"
><HR><H1
CLASS="sect1"
><A
NAME="paloearlyboot"
></A
>3.4. How to use <B
CLASS="command"
>PALO</B
> at early boot stage?</H1
><DIV
CLASS="sect2"
><H2
CLASS="sect2"
><A
NAME="palotheory"
></A
>3.4.1. The theory</H2
><P
>&#13;						You have setup everything, rebooted your box, and suddenly you
						want to change something to the kernel boot arguments,
						or even boot another kernel. Damn it! How could you,
						now that the box is booting? Well, stay calm and relax,
						have a deep breath, we have the solution!
						Unfortunately, by the time you'll learn about it, your box
						will have finished booting ;o)
					</P
><P
>&#13;						First, you must learn how to interact with <B
CLASS="command"
>PALO</B
> during the startup sequence.
						You have to enter <B
CLASS="command"
>BOOT_ADMIN</B
>, as explained in <A
HREF="#enterbootadmin"
>Section 2.1.1</A
>.
						For some old models (up to 712 or so), you must add the
						<TT
CLASS="parameter"
><I
>ipl</I
></TT
> (or <TT
CLASS="parameter"
><I
>isl</I
></TT
>) string to
						your boot command in the <B
CLASS="command"
>BOOT_ADMIN</B
> console:
						<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
><TT
CLASS="computeroutput"
>BOOT_ADMIN&#62; </TT
>boot pri ipl</PRE
></FONT
></TD
></TR
></TABLE
>
						On most PA-RISC boxes, the system will ask you if you want to interact
						with <EM
>IPL</EM
> anyway. You just have to answer
						"<B
CLASS="keycap"
>y</B
>" and hit <B
CLASS="keycap"
>Enter</B
>.
						You will then end up to <B
CLASS="command"
>PALO</B
> configuration display, with the list
						of all parameters and their corresponding numbers.
					</P
><P
>&#13;						You just have to enter the number corresponding to the
						parameter you want to change.
						Hit <B
CLASS="keycap"
>Enter</B
>, modify it and validate the
						changes by hitting <B
CLASS="keycap"
>Enter</B
> again.
						The system will redisplay the new list.
						This modification is not permanent<A
NAME="AEN853"
HREF="#FTN.AEN853"
><SPAN
CLASS="footnote"
>[5]</SPAN
></A
>!
						If you want to add a supplementary parameter, select any one
						and write yours on the editing line, beginning with a space:
						<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;&#60;#&#62;    edit the numbered field
'b'    boot with this command line
'r'    restore command line
'l'    list dir
? 0
3/boot/vmlinux initrd=3/initrd.img
						</PRE
></FONT
></TD
></TR
></TABLE
>

						After validation, the list will count one more parameter.
						If you want to delete one, select it and erase the complete entry.
						You will see that the list counts one less parameter.
					</P
><P
>&#13;						For more informations about <B
CLASS="command"
>PALO</B
>, please take look at the
						<A
HREF="http://cvs.parisc-linux.org/*checkout*/palo/README.html?rev=HEAD"
TARGET="_top"
><B
CLASS="command"
>PALO</B
> README</A
>.
						You can find a copy of this file after having installed the <B
CLASS="command"
>palo</B
>
						package in <TT
CLASS="filename"
>/usr/share/doc/palo/README.html</TT
>.
						This HOWTO section is mostly inspired from the above file, written by Paul Bame.
					</P
></DIV
><DIV
CLASS="sect2"
><HR><H2
CLASS="sect2"
><A
NAME="paloexample"
></A
>3.4.2. A complete example</H2
><DIV
CLASS="highlights"
><A
NAME="AEN866"
></A
><P
>&#13;						This example has been suggested by Michael Damaschke. We will use notions
						explained in <A
HREF="#bootadmin"
>Section 2.1</A
> and <A
HREF="#palotheory"
>Section 3.4.1</A
>,
						and refer to concept such as <EM
>console</EM
>, seen in
						<A
HREF="#consoles"
>Section 2.2</A
>.
						So, let's go for the story of the happy PA/Linux user booting a kernel,
						also called "<EM
>I don't know how to configure my workstation
						to use the kernel I want during boot sequence!</EM
>".
					</P
></DIV
><P
>&#13;						After switching your workstation on, a message on the
						console will tell you that the workstation is about to start
						automatically the boot sequence, except if you hold the
						<B
CLASS="keycap"
>Esc</B
> key to stop the auto-booting process.
						This is a very difficult step: you must hold the
						<B
CLASS="keycap"
>Esc</B
> key down ;o)
					</P
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;						Depending on your model, you might need to press this key
						during a quite long time.
					</P
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="tip"
><P
></P
><TABLE
CLASS="tip"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/tip.gif"
HSPACE="5"
ALT="Tip"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;						In some cases when using graphic console, the monitor can be
						too slow to trigger on, and won't allow you to see the
						warning message. A good workaround is to keep a close eye on
						the keyboard's lights: when they all blink at once, this is
						the right time to press and hold the <B
CLASS="keycap"
>Esc</B
> key.
						If you still have troubles, please refer to <A
HREF="#consoles"
>Section 2.2</A
>.
					</P
></TD
></TR
></TABLE
></DIV
><P
>&#13;						There are a few different ways to get access to
						<B
CLASS="command"
>BOOT_ADMIN</B
> (see <A
HREF="#enterbootadmin"
>Section 2.1.1</A
>).
						If you have an old box, you will see an information message displayed,
						where the workstation's firmware tells you that it will
						start searching for all bootable devices,
						or that you can break this by holding down the <B
CLASS="keycap"
>Esc</B
> key.
						This is the same procedure as just mentioned, you must
						press the <B
CLASS="keycap"
>Esc</B
> key.
					</P
><P
>&#13;						As usual, on some machines you might then get a menu where you should press the
						<B
CLASS="keycap"
>a</B
> key followed by <B
CLASS="keycap"
>Enter</B
>.
						You are now facing the deadly '<TT
CLASS="computeroutput"
>BOOT_ADMIN&#62;</TT
>'
						prompt :^). First, we will turn off <TT
CLASS="literal"
>auto boot</TT
>
						process by entering the following lines:
					</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
><TT
CLASS="computeroutput"
>BOOT_ADMIN&#62; </TT
>auto boot off</PRE
></FONT
></TD
></TR
></TABLE
><P
>&#13;						then hit <B
CLASS="keycap"
>Enter</B
> to validate. This will prevent the
						box from further attempts at auto-booting. In other words, you won't
						have to stop the boot process with <B
CLASS="keycap"
>Esc</B
>, it will stop
						on its own on subsequent reboots and wait for your instructions.
					</P
><P
>&#13;						Now, you must tell the system from which boot device you
						would like to boot. If it's a hard drive, it must have a
						'<TT
CLASS="literal"
>f0</TT
>' partition at the beginning
						(see <A
HREF="#bootsolutions"
>Chapter 4</A
>).
					</P
><P
>&#13;						In this example, the old kernel is <TT
CLASS="filename"
>vmlinux</TT
> and
						the new one is <TT
CLASS="filename"
>vmlinux-2.4.17-pa3</TT
>.
						The chosen SCSI boot device is designed by:
						<TT
CLASS="computeroutput"
>&#13;						SCSI.<TT
CLASS="replaceable"
><I
>X</I
></TT
>.0,
						</TT
>
						where <TT
CLASS="replaceable"
><I
>X</I
></TT
> is the SCSI-ID of the disk you
						want to boot from<A
NAME="AEN906"
HREF="#FTN.AEN906"
><SPAN
CLASS="footnote"
>[6]</SPAN
></A
>.	<EM
>e.g.:</EM
>
					</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
><TT
CLASS="computeroutput"
>BOOT_ADMIN&#62; </TT
>boot SCSI.5.0</PRE
></FONT
></TD
></TR
></TABLE
><P
>&#13;						At the end of the previous command line, you must add the
						<TT
CLASS="parameter"
><I
>IPL</I
></TT
> token if you have a HP 9000/7xx
						system to specify that you want to interact with
						<SPAN
CLASS="application"
>IPL</SPAN
>. If you have a more
						recent hardware, the system will ask if you want to
						interact with <SPAN
CLASS="application"
>IPL</SPAN
> anyway:
					</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
><TT
CLASS="computeroutput"
>Interact with IPL (Y or N)?&#62;</TT
></PRE
></FONT
></TD
></TR
></TABLE
><P
>&#13;						Say <B
CLASS="keycap"
>Y</B
> and hit <B
CLASS="keycap"
>Enter</B
>.
						Now, you can manually configure the <B
CLASS="command"
>PALO</B
> boot parameters.
						A new menu is displayed, where you can configure on line
						'<TT
CLASS="computeroutput"
>0</TT
>' (selected by default)
						the boot partition number, and the path of your boot kernel.
					</P
><P
>&#13;						Here is the complete session log of a A500 serial console output,
						taken from <B
CLASS="command"
>PALO</B
> version 1.5. You can find in <A
HREF="#oldpaloa500"
>Section B.1</A
>
						a session log with an older version of palo, such as the one that
						can be found on Debian 3.0 install disks.
					</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;Main Menu: Enter command or menu &#62; bo scsi.5.0
Interact with IPL (Y, N, or Cancel)?&#62; y

Booting...
Boot IO Dependent Code (IODC) revision 1


HARD Booted.
palo ipl 1.5 root@c3k Fri May 14 16:17:38 MDT 2004
Skipping extended partition 6 - beyond reach of IPL

Partition Start(MB) End(MB) Id Type
1               1      31   f0 Palo
2              32     153   83 ext2
3             154    1107   82 swap
5            1108    5875   83 ext2

PALO(F0) partition contains:
    0/vmlinux64 5279419 bytes @ 0x44000

Information: No console specified on kernel command line. This is normal.
PALO will choose the console currently used by firmware (serial).
Current command line:
2/vmlinux root=/dev/sdb5 HOME=/ console=ttyS0 TERM=vt102
 0: 2/vmlinux
 1: root=/dev/sdb5
 2: HOME=/
 3: console=ttyS0
 4: TERM=vt102

&#60;#&#62;    edit the numbered field
'b'    boot with this command line
'r'    restore command line
'l'    list dir
? 0
2/vmlinux-2.6-cvs initrd=2/initrd.img-cvs
Current command line:
2/vmlinux-2.6-cvs initrd=2/initrd.img-cvs root=/dev/sdb5 HOME=/ console=ttyS0 TERM=vt102
 0: 2/vmlinux-2.6-cvs
 1: initrd=2/initrd.img-cvs
 2: root=/dev/sdb5
 3: HOME=/
 4: console=ttyS0
 5: TERM=vt102

&#60;#&#62;    edit the numbered field
'b'    boot with this command line
'r'    restore command line
'l'    list dir
? 1

Current command line:
2/vmlinux-2.6-cvs  root=/dev/sdb5 HOME=/ console=ttyS0 TERM=vt102
 0: 2/vmlinux-2.6-cvs
 1: root=/dev/sdb5
 2: HOME=/
 3: console=ttyS0
 4: TERM=vt102

&#60;#&#62;    edit the numbered field
'b'    boot with this command line
'r'    restore command line
'l'    list dir
? b
					</PRE
></FONT
></TD
></TR
></TABLE
><P
>&#13;						<B
CLASS="command"
>PALO</B
> was first setup to boot the kernel file <TT
CLASS="filename"
>vmlinux</TT
>
						located on the second partition of the SCSI device ID 5 LUN 0.
						(We know this since we have asked <B
CLASS="command"
>BOOT_ADMIN</B
> to boot on this device).
						But we wanted another kernel this time.
						We have pressed the <B
CLASS="keycap"
>Enter</B
> key (to validate the default
						choice '<TT
CLASS="computeroutput"
>0</TT
>')
						and modified the text to match our needs, here
						<TT
CLASS="filename"
>vmlinux-2.6-cvs</TT
>. We have also
						added an <TT
CLASS="computeroutput"
>initrd=2/initrd.img-cvs</TT
> argument
						to the command line. We have validated our changes
						by hitting the <B
CLASS="keycap"
>Enter</B
> key.
						Finally we have decided that we didn't want this
						additional argument, so we have selected it and erased it.
						At the end it asked again which field we wanted to edit, we
						just typed '<TT
CLASS="computeroutput"
>b</TT
>' instead
						of any number and hit <B
CLASS="keycap"
>Enter</B
> to boot our new kernel.
					</P
><DIV
CLASS="caution"
><P
></P
><TABLE
CLASS="caution"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/caution.gif"
HSPACE="5"
ALT="Caution"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;						Please don't change any other parameter unless you
						really know what you are doing!
					</P
></TD
></TR
></TABLE
></DIV
><P
>&#13;						That's it! <B
CLASS="command"
>PALO</B
> has no more secrets for you :-)
					</P
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;						As you might have noticed, the <B
CLASS="command"
>BOOT_ADMIN</B
> interface can take several
						aspects, so don't be disappointed if yours does not
						exactly match our examples.
					</P
></TD
></TR
></TABLE
></DIV
></DIV
></DIV
></DIV
><DIV
CLASS="chapter"
><HR><H1
><A
NAME="bootsolutions"
></A
>Chapter 4. Available boot solutions</H1
><DIV
CLASS="sect1"
><H1
CLASS="sect1"
><A
NAME="bootcd"
></A
>4.1. Booting from CD</H1
><DIV
CLASS="highlights"
><A
NAME="AEN948"
></A
><P
>&#13;				Booting from CD is one of the easiest way to start and
				install your PA-RISC machine; assuming you have a CD drive
				handy and a bootable CD. You can download official Debian
				ISOs as well as <EM
>Net Install</EM
> ISO
				(see <A
HREF="#glossnetinst"
><I
CLASS="glossterm"
>netinst</I
></A
>) from the
				<A
HREF="http://www.debian.org/devel/debian-installer/"
TARGET="_top"
>Debian Installer pages</A
>,
				or from the <A
HREF="ftp://www.parisc-linux.org/cd-images/"
TARGET="_top"
>PA-RISC/Linux official website</A
>.
			</P
></DIV
><P
></P
><OL
TYPE="i"
><LI
><P
>Start the box and enter the <B
CLASS="command"
>BOOT_ADMIN</B
> mode. (<A
HREF="#enterbootadmin"
>Section 2.1.1</A
>)</P
></LI
><LI
><P
>&#13;						Place your bootable CD on the CD tray and close it.
						Sounds obvious, but we know guys who missed that step :)
					</P
></LI
><LI
><P
>&#13;						There are two options from there: either you know the
						full <TT
CLASS="literal"
>PATH</TT
> to your CD device,
						then you can jump to next step, or you don't.
						In this last case, issue a <B
CLASS="command"
>search ipl</B
>
						to list all available bootable devices.
						You can also specify
						<B
CLASS="command"
>search <TT
CLASS="replaceable"
><I
>[PATH]</I
></TT
></B
>,
						which is fastest.
						For instance if you want to search the SCSI bus:
					</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>search SCSI</PRE
></FONT
></TD
></TR
></TABLE
><P
>&#13;						On recent boxes, <B
CLASS="command"
>search disk</B
> is quite helpful.
						Take a look at <B
CLASS="command"
>help search</B
> for details specific to your box.
					</P
></LI
><LI
><P
>&#13;						Once you know the full <TT
CLASS="literal"
>PATH</TT
> to your CD drive,
						you can issue a <B
CLASS="command"
>boot <TT
CLASS="replaceable"
><I
>&#60;PATH&#62;</I
></TT
></B
>.
						That's all. If everything goes fine, it will start booting the CD present
						in the CD reader.	Real life example:
					</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>boot ide</PRE
></FONT
></TD
></TR
></TABLE
></LI
></OL
></DIV
><DIV
CLASS="sect1"
><HR><H1
CLASS="sect1"
><A
NAME="boothd"
></A
>4.2. Booting from hard drive</H1
><DIV
CLASS="highlights"
><A
NAME="AEN979"
></A
><P
>&#13;				Booting from hard drive is not really more difficult that
				booting from CD. The only thing really important is that
				your hard drive has to be correctly prepared. Take a look
				at <A
HREF="#bootablepartition"
>Section 3.3.3</A
> to learn how to
				prepare it.
			</P
></DIV
><P
></P
><OL
TYPE="i"
><LI
><P
>&#13;						Start the box and enter the <B
CLASS="command"
>BOOT_ADMIN</B
> mode.
						(<A
HREF="#enterbootadmin"
>Section 2.1.1</A
>)
					</P
></LI
><LI
><P
>&#13;						There are two options from there: either you know the
						full <TT
CLASS="literal"
>PATH</TT
> to your hard disk device,
						then you can jump to next step, or you don't.
						In this last case, issue a <B
CLASS="command"
>search ipl</B
>
						to list all available bootable devices.
						You can also specify
						<B
CLASS="command"
>search <TT
CLASS="replaceable"
><I
>[PATH]</I
></TT
></B
>.
						For instance if you want to search the Single Ended SCSI bus:
					</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>search SESCSI</PRE
></FONT
></TD
></TR
></TABLE
><P
>&#13;						Take a look at <B
CLASS="command"
>help search</B
>
						for details specific to your box.
					</P
></LI
><LI
><P
>&#13;						Once you know the full <TT
CLASS="literal"
>PATH</TT
> to your hard drive,
						you can issue a <B
CLASS="command"
>boot <TT
CLASS="replaceable"
><I
>&#60;PATH&#62;</I
></TT
></B
>.
						That's all. If everything goes fine, it will start booting the kernel
						as setup by <B
CLASS="command"
>PALO</B
> (see <A
HREF="#bootablepartition"
>Section 3.3.3</A
>).
						Real life example:
					</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>boot scsi.6</PRE
></FONT
></TD
></TR
></TABLE
></LI
></OL
></DIV
><DIV
CLASS="sect1"
><HR><H1
CLASS="sect1"
><A
NAME="bootnetwork"
></A
>4.3. Booting from network</H1
><DIV
CLASS="highlights"
><A
NAME="AEN1006"
></A
><P
>&#13;				Booting from the network is only required in certain cases. Booting from the network is very
				usefull when you have unsupported I/O devices, diskless systems, or systems with broken hardware.
				Network booting is detailed below.
			</P
></DIV
><DIV
CLASS="sect2"
><HR><H2
CLASS="sect2"
><A
NAME="preparingnetboot"
></A
>4.3.1. Preparing to boot from network</H2
><DIV
CLASS="highlights"
><A
NAME="AEN1010"
></A
><P
>&#13;					Booting from the network involves two machines: the <EM
>boot server</EM
>
					and the <EM
>boot client</EM
>, the latter being the PA-RISC system you are
					trying to start up, and the former, the machine that will serve over the network
					the files which the client needs.
					The rest of this section will extensively deal with setting up the <EM
>boot
					server</EM
> since this is probably the trickiest part.
				</P
></DIV
><DIV
CLASS="important"
><P
></P
><TABLE
CLASS="important"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/important.gif"
HSPACE="5"
ALT="Important"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;					You will need a <EM
>lifimage</EM
> to perform a network boot.
					See <A
HREF="#whatdoespalo"
>Section 3.2</A
> to learn how to create one.
					You can also use the one from
					<A
HREF="http://ftp.debian.org/debian/dists/sarge/main/installer-hppa/current/images/netboot/2.6/boot.img"
TARGET="_top"
>&#13;					Debian Installer</A
>.
				</P
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;					Needless to say, all server-side setup is meant to be performed by the
					<EM
>super-user</EM
>, also known as <TT
CLASS="literal"
>root</TT
>.
				</P
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="sect2"
><HR><H2
CLASS="sect2"
><A
NAME="rbootorbootp"
></A
>4.3.2. rboot or bootp?</H2
><DIV
CLASS="highlights"
><A
NAME="AEN1026"
></A
><P
>&#13;					All 'recent' machines can boot using
					<TT
CLASS="literal"
>BOOTP</TT
>, starting from 715/100,
					715/120, and 712s. Older ones, mostly early 715s,
					710s and 725s need <TT
CLASS="literal"
>RBOOT</TT
>.
				</P
></DIV
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;					To use <TT
CLASS="literal"
>BOOTP</TT
> you have to enable
					the
					<SPAN
CLASS="guimenu"
>IP: Kernel level autoconfiguration</SPAN
>-&gt;<SPAN
CLASS="guimenuitem"
>IP: BOOTP support</SPAN
>
					within the '<TT
CLASS="literal"
>Networking options</TT
>'
					section of the kernel configuration, if you want to use a
					<EM
>home-made</EM
> kernel. See <A
HREF="#vmlinux"
>Chapter 5</A
>
					for details.
				</P
></TD
></TR
></TABLE
></DIV
><P
>&#13;					Please note that though <A
HREF="#usingrbootd"
>Section 4.3.3</A
> deals with
					<TT
CLASS="literal"
>RBOOT</TT
> only, two different implementations of the
					<TT
CLASS="literal"
>BOOTP</TT
> protocol are detailed in <A
HREF="#usingdhcp"
>Section 4.3.4</A
>
					and <A
HREF="#usingbootp"
>Section 4.3.5</A
>. We detail these two <EM
>because
					we can</EM
>, but if you need to use the <TT
CLASS="literal"
>BOOTP</TT
>
					protocol, you will have to choose one.
				</P
><DIV
CLASS="tip"
><P
></P
><TABLE
CLASS="tip"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/tip.gif"
HSPACE="5"
ALT="Tip"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;					If you don't know which <TT
CLASS="literal"
>BOOTP</TT
> implementation to use,
					go for the <B
CLASS="command"
>dhcp</B
> one, it is much easier to deal with.
				</P
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="sect2"
><HR><H2
CLASS="sect2"
><A
NAME="usingrbootd"
></A
>4.3.3. Using rboot</H2
><DIV
CLASS="sect3"
><H3
CLASS="sect3"
><A
NAME="AEN1053"
></A
>4.3.3.1. Obtaining rbootd</H3
><P
>&#13;						If you have an old machine that requires <B
CLASS="command"
>rboot</B
>
						to boot over network, use the following procedure to set up and
						configure a boot server, and boot using the PA-RISC/Linux kernel.
					</P
><P
>&#13;						Old machines, including the Scorpio 715s, use the
						<TT
CLASS="literal"
>RBOOT</TT
> protocol. You need <B
CLASS="command"
>rbootd</B
>
						to handle their boot requests. Look for it in your favorite distribution
						archive (assuming you will be servicing boot requests from a Linux box).
						Here are two ways of getting the <B
CLASS="command"
>rboot</B
> daemon:
					</P
><P
></P
><UL
><LI
><P
>&#13;								If you are using a Debian-powered server (which you really should be doing ;o),
								you're almost done. Run from a command shell:
							</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;<TT
CLASS="prompt"
>[user@machine ~/dir]&#62;</TT
> <B
CLASS="command"
>apt-get</B
> <TT
CLASS="userinput"
><B
>install rbootd</B
></TT
>
							</PRE
></FONT
></TD
></TR
></TABLE
></LI
><LI
><P
>&#13;								If you can't find any <B
CLASS="command"
>rbootd</B
> package for your system
								(which is very possible since it is a very old netboot protocol), you can find
								its source in the Debian archive:
								<A
HREF="http://packages.debian.org/stable/net/rbootd.html"
TARGET="_top"
>rbootd</A
>.
								You will have to build it from source.
							</P
></LI
></UL
></DIV
><DIV
CLASS="sect3"
><HR><H3
CLASS="sect3"
><A
NAME="rbootd"
></A
>4.3.3.2. Configuring rbootd</H3
><P
>&#13;						As we already said, to boot a <TT
CLASS="literal"
>RBOOT</TT
>-aware system, you need
						a separate machine with <B
CLASS="command"
>rbootd</B
>
						installed (this is the 'boot server') on which you will store the
						PA-RISC/Linux kernel <EM
>lifimage</EM
> that you want to use to boot
						your PA-RISC system with.
					</P
><P
>&#13;						Once the <B
CLASS="command"
>rbootd</B
> server software is installed,
						read the following to configure it to work with your PA-RISC system:
					</P
><P
>&#13;						In <TT
CLASS="filename"
>/etc/rbootd.conf</TT
> you will have to add a line like:
					</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>ethernet_addr            bootfile</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
><OL
TYPE="1"
><LI
><P
>&#13;								Replace <TT
CLASS="replaceable"
><I
>bootfile</I
></TT
> with the name of your
								PA-RISC/Linux kernel image, usually '<TT
CLASS="filename"
>lifimage</TT
>'.
							</P
></LI
><LI
><A
NAME="getmac"
></A
><P
>&#13;								Now get the Ethernet address of your PA-RISC system by typing
								<B
CLASS="command"
>lanaddress</B
> at the
								'<TT
CLASS="computeroutput"
>BOOT_ADMIN&#62;</TT
>' prompt
								(see <A
HREF="#bootadminfo"
>Section 2.1.2.3</A
>).
							</P
><P
>&#13;								It will return a number like
								<TT
CLASS="computeroutput"
>080009-7004b6</TT
>. Take note of this number.
							</P
></LI
><LI
><P
>&#13;								In <TT
CLASS="filename"
>/etc/rbootd.conf</TT
> on your boot server, the
								Ethernet address has to be colon-delimited.  That means you will have to modify
								the number you just obtained so that every set of two characters (after removing the
								'-') is separated by a colon.  For example:
								<TT
CLASS="computeroutput"
>080009-7004b6</TT
> becomes
							  <TT
CLASS="computeroutput"
>08:00:09:70:04:b6</TT
>.
								Add the colon delimited Ethernet address to
								<TT
CLASS="filename"
>/etc/rbootd.conf</TT
> on your boot server. The
								resulting file will look something like this:
							</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;# ethernet addr        boot file           comments

08:00:09:87:e4:8f      lifimage_715        # PA/Linux kernel for 715/33
08:00:09:70:04:b6      lifimage_720        # PA/Linux kernel for 720
							</PRE
></FONT
></TD
></TR
></TABLE
><P
>&#13;								This <TT
CLASS="filename"
>rbootd.conf</TT
> example contains the Ethernet
								addresses and boot file names for two different machines.
							</P
><P
>&#13;								Once you have changed the configuration file, restart
								<B
CLASS="command"
>rbootd</B
>.
							</P
></LI
></OL
><P
>&#13;						By default, <B
CLASS="command"
>rbootd</B
> assumes that bootfiles are located
						in <TT
CLASS="filename"
>/var/lib/rbootd/</TT
>. Therefore,
						you will have to put your bootable kernel image in that directory, or,
						if you really hate that directory for some reason, you can rebuild
						<B
CLASS="command"
>rbootd</B
> to use a different directory.
					</P
><P
>&#13;						The easiest thing, of course, is just to drop your kernel images in
						the default directory!
					</P
></DIV
></DIV
><DIV
CLASS="sect2"
><HR><H2
CLASS="sect2"
><A
NAME="usingdhcp"
></A
>4.3.4. Using dhcp/tftp</H2
><P
>&#13;					We will see here how to setup a <TT
CLASS="literal"
>DHCP</TT
> server
					to handle <TT
CLASS="literal"
>BOOTP</TT
> requests (since PA-RISC box use
					<TT
CLASS="literal"
>BOOTP</TT
>, unless they need <TT
CLASS="literal"
>RBOOT</TT
>,
					as mentioned above).
				</P
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;					<SPAN
CLASS="trademark"
>Windows</SPAN
>&#8482; users might want to look at <A
HREF="#win2kdhcp"
>Appendix A</A
>.
				</P
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="sect3"
><HR><H3
CLASS="sect3"
><A
NAME="AEN1122"
></A
>4.3.4.1. Obtaining dhcp/tftp</H3
><P
>&#13;						Debian users will just have to install the packages using the
						following commands, executed as <TT
CLASS="literal"
>root</TT
>:
					</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;<TT
CLASS="prompt"
>[user@machine ~/dir]&#62;</TT
> <B
CLASS="command"
>apt-get</B
> <TT
CLASS="userinput"
><B
>install dhcp tftpd</B
></TT
>
					</PRE
></FONT
></TD
></TR
></TABLE
><P
>&#13;						If you need rpm packages (for the ISC dhcp server), the best
						way is to go to <A
HREF="http://rpmfind.net/"
TARGET="_top"
>http://rpmfind.net/</A
>.
					</P
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;						The dhcp package can do much more than a simple bootp daemon.
						Nevertheless, it is also known to be much easier to configure.
						If you really want to try regular <B
CLASS="command"
>bootp</B
>, skip
						this and go to <A
HREF="#usingbootp"
>Section 4.3.5</A
>.
					</P
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="sect3"
><HR><H3
CLASS="sect3"
><A
NAME="AEN1136"
></A
>4.3.4.2. Configuring dhcp/tftp</H3
><P
>&#13;						Here are the instructions to set up <B
CLASS="command"
>dhcp</B
> on your
						boot server. To keep this explanation simple, we will assume that
						you want to assign a fixed IP to your box, without DNS update. Your
						subnet will be <TT
CLASS="literal"
>192.168.1.0/24</TT
>, with optional:
						gateway at <TT
CLASS="literal"
>192.168.1.1</TT
>, domain name
						<TT
CLASS="literal"
>foo.com</TT
> and DNS at <TT
CLASS="literal"
>192.168.1.4</TT
>.
						Feel free to replace these values with those which would suit your
						needs in the next sections.
					</P
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;						This section is dedicated to Debian users.
						For others distributions, it should be similar though
						there may be some differences like default directories.
					</P
></TD
></TR
></TABLE
></DIV
><P
></P
><OL
TYPE="1"
><LI
><P
>&#13;								Edit <TT
CLASS="filename"
>/etc/inetd.conf</TT
> on your boot
								server to add the following line, if it doesn't already exist:
								<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;tftp           dgram   udp     wait    nobody  /usr/sbin/tcpd \
														/usr/sbin/in.tftpd /tftpboot
								</PRE
></FONT
></TD
></TR
></TABLE
>
								Here, <TT
CLASS="filename"
>/tftpboot/</TT
>
								is being used as tftpd server's root (this is where you will put the
								<EM
>lifimage</EM
> file). You can choose another
								directory if you want. According to <B
CLASS="command"
>man tftpd</B
>,
								this is the usual default directory.
							</P
><P
>&#13;								When this is done, reload <B
CLASS="command"
>inetd</B
> with:
								<B
CLASS="command"
>/etc/init.d/inetd reload</B
>. Non-Debian users can also
								issue a <B
CLASS="command"
>killall -HUP inetd</B
>.
							</P
></LI
><LI
><P
>&#13;								According to <B
CLASS="command"
>man 5 dhcpd.conf</B
>, edit the
								<TT
CLASS="filename"
>/etc/dhcpd.conf</TT
> file to contain something like:
								<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;allow bootp;
default-lease-time 600;
max-lease-time 7200;
# This will tell the box its hostname while booting:
use-host-decl-names on;

subnet <TT
CLASS="replaceable"
><I
>192.168.1.0</I
></TT
> netmask 255.255.255.0 {
		option routers <TT
CLASS="replaceable"
><I
>192.168.1.1</I
></TT
>;
		option domain-name "<TT
CLASS="replaceable"
><I
>foo.com</I
></TT
>";
		option domain-name-server <TT
CLASS="replaceable"
><I
>192.168.1.4</I
></TT
>;
}

host <TT
CLASS="replaceable"
><I
>[hostname]</I
></TT
> {
		hardware ethernet <TT
CLASS="replaceable"
><I
>[mac address]</I
></TT
>;
		fixed-address <TT
CLASS="replaceable"
><I
>[ip address]</I
></TT
>;
		filename "<TT
CLASS="replaceable"
><I
>[boot filename]</I
></TT
>";
		option root-path "<TT
CLASS="replaceable"
><I
>[root path]</I
></TT
>";
}
								</PRE
></FONT
></TD
></TR
></TABLE
>
								You have to fill in the <TT
CLASS="replaceable"
><I
>[hostname]</I
></TT
>,
								<TT
CLASS="replaceable"
><I
>[mac address]</I
></TT
>,
								<TT
CLASS="replaceable"
><I
>[ip address]</I
></TT
>,
								<TT
CLASS="replaceable"
><I
>[boot filename]</I
></TT
> and
								<TT
CLASS="replaceable"
><I
>[root path]</I
></TT
> fields with the
								appropriate information, where:
							</P
><P
></P
><UL
><LI
><P
>&#13;								  	<TT
CLASS="replaceable"
><I
>[hostname]</I
></TT
>
										is the name of the PA-RISC system.
									</P
></LI
><LI
><P
>&#13;								  	<TT
CLASS="replaceable"
><I
>[mac address]</I
></TT
>
										is the colon-delimited ethernet address of the PA-RISC system, which
										can be obtained by typing <B
CLASS="command"
>lanaddress</B
> at the
										'<TT
CLASS="computeroutput"
>BOOT_ADMIN&#62;</TT
>' prompt
										(see <A
HREF="#bootadminfo"
>Section 2.1.2.3</A
>).
									</P
></LI
><LI
><P
>&#13;								  	<TT
CLASS="replaceable"
><I
>[ip address]</I
></TT
>
										is the IP address you wish to assign to the PA-RISC system.
									</P
></LI
><LI
><P
>&#13;								  	<TT
CLASS="replaceable"
><I
>[boot filename]</I
></TT
>
										is the name of the bootable kernel image you want to boot your system with.
									</P
></LI
><LI
><P
>&#13;								  	<TT
CLASS="replaceable"
><I
>[root path]</I
></TT
>
										is the path to the NFS root filesystem exported by the server.
									</P
></LI
><LI
><P
>&#13;										Additionally, if the tftp server you want to use is not the same as the one
										running the dhcp server, you can add <TT
CLASS="computeroutput"
>next-server
										<TT
CLASS="replaceable"
><I
>[ip address]</I
></TT
>;</TT
>, replacing
										<TT
CLASS="replaceable"
><I
>[ip address]</I
></TT
> with the actual IP of the tftp
										server, to the dhcp configuration.
									</P
></LI
></UL
><P
>&#13;								You'll end up with something like this for each box
								you want to <EM
>netboot</EM
>:
							  <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;host tatooine {
		hardware ethernet 00:40:05:18:0c:dd;
		fixed-address 192.168.1.22;
		filename "lifimage-tatooine";
		option root-path "/exports/tatooineroot";
}
								</PRE
></FONT
></TD
></TR
></TABLE
>
				      </P
></LI
></OL
></DIV
></DIV
><DIV
CLASS="sect2"
><HR><H2
CLASS="sect2"
><A
NAME="usingbootp"
></A
>4.3.5. Using bootp/tftp</H2
><DIV
CLASS="sect3"
><H3
CLASS="sect3"
><A
NAME="AEN1206"
></A
>4.3.5.1. Obtaining bootp/tftp</H3
><P
>&#13;						For Debian users, you just have to install the packages by typing
						these commands as user <TT
CLASS="literal"
>root</TT
>:
						<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;<TT
CLASS="prompt"
>[user@machine ~/dir]&#62;</TT
> <B
CLASS="command"
>apt-get</B
> <TT
CLASS="userinput"
><B
>install bootp tftpd</B
></TT
>
						</PRE
></FONT
></TD
></TR
></TABLE
>
						If you need rpm packages, the best way is to go to
						<A
HREF="http://rpmfind.net/"
TARGET="_top"
>http://rpmfind.net/</A
>.
					</P
><DIV
CLASS="warning"
><P
></P
><TABLE
CLASS="warning"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/warning.gif"
HSPACE="5"
ALT="Warning"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;						You'll have been warned! This daemon is far more obfuscated
						in its configuration.
					</P
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="sect3"
><HR><H3
CLASS="sect3"
><A
NAME="AEN1217"
></A
>4.3.5.2. Configuring bootp/tftp</H3
><P
>&#13;						Follow these instructions to use the <B
CLASS="command"
>bootp</B
>
						daemon on your boot server:
					</P
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;						This section is dedicated to Debian users.
						For others distributions, it should be similar though
						there may be some differences like default directories.
					</P
></TD
></TR
></TABLE
></DIV
><P
></P
><OL
TYPE="1"
><LI
><P
>&#13;								Edit <TT
CLASS="filename"
>/etc/inetd.conf</TT
> on your boot server
								to add the following lines, if they don't already exist:
							  <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;tftp            dgram   udp     wait    nobody  /usr/sbin/tcpd       \
											/usr/sbin/in.tftpd /tftpboot
bootps          dgram   udp     wait    root    /usr/sbin/bootpd     \
														bootpd -i -t 120
								</PRE
></FONT
></TD
></TR
></TABLE
>
								Here, <TT
CLASS="filename"
>/tftpboot/</TT
> is being
								used as tftpd server's root (this is where you will put the
								<EM
>lifimage</EM
> file). You can choose another directory
								if you want. According to <B
CLASS="command"
>man tftpd</B
>, this
								is the usual default directory.
							</P
><P
>&#13;								When this is done, reload <B
CLASS="command"
>inetd</B
> with:
								<B
CLASS="command"
>/etc/init.d/inetd reload</B
>. Non-Debian users can also issue
								a <B
CLASS="command"
>killall -HUP inetd</B
>.
							</P
></LI
><LI
><P
>&#13;								According to <B
CLASS="command"
>man 5 bootptab</B
>, edit the
								<TT
CLASS="filename"
>/etc/bootptab</TT
> file to contain:
								<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;<TT
CLASS="replaceable"
><I
>[hostname]</I
></TT
>:hd=/tftpboot:\
			:rp=<TT
CLASS="replaceable"
><I
>[root path]</I
></TT
>:\
			:ht=ethernet:\
			:ha=<TT
CLASS="replaceable"
><I
>[mac address]</I
></TT
>:\
			:ip=<TT
CLASS="replaceable"
><I
>[ip address]</I
></TT
>:\
			:bf=<TT
CLASS="replaceable"
><I
>[boot filename]</I
></TT
>:\
			:sm=255.255.255.0:\
			:to=7200:
								</PRE
></FONT
></TD
></TR
></TABLE
>
								You have to fill in the <TT
CLASS="replaceable"
><I
>[hostname]</I
></TT
>,
								<TT
CLASS="replaceable"
><I
>[mac address]</I
></TT
>,
								<TT
CLASS="replaceable"
><I
>[ip address]</I
></TT
> and
								<TT
CLASS="replaceable"
><I
>[root path]</I
></TT
>
								fields with the appropriate information, where:
							</P
><P
></P
><UL
><LI
><P
>&#13;								  	<TT
CLASS="replaceable"
><I
>[hostname]</I
></TT
> is the name
										of the PA-RISC system.
									</P
></LI
><LI
><P
>&#13;								  	<TT
CLASS="replaceable"
><I
>[mac address]</I
></TT
> is the
										NOT-delimited ethernet address of the PA-RISC system, which can be obtained
										by typing <B
CLASS="command"
>lanaddress</B
> at the
										'<TT
CLASS="computeroutput"
>BOOT_ADMIN&#62;</TT
>' prompt
										(see <A
HREF="#bootadminfo"
>Section 2.1.2.3</A
>).
									</P
></LI
><LI
><P
>&#13;								  	<TT
CLASS="replaceable"
><I
>[ip address]</I
></TT
> is the
										IP address you wish to assign to the PA-RISC system.
									</P
></LI
><LI
><P
>&#13;								  	<TT
CLASS="replaceable"
><I
>[boot filename]</I
></TT
> is the
										name of the bootable kernel image you want to boot your system with.
									</P
></LI
><LI
><P
>&#13;								  	<TT
CLASS="replaceable"
><I
>[root path]</I
></TT
> is the
										path to the NFS root filesystem exported by the server.
									</P
></LI
></UL
><P
>You'll end up with something like this:</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;vodka:hd=/tftpboot:\
	 :rp=/usr/src/parisc/:\
	 :ht=ethernet:\
	 :ha=080069088717:\
	 :ip=140.244.9.208:\
	 :bf=lifimage:\
	 :sm=255.255.255.0:\
	 :to=7200:
							</PRE
></FONT
></TD
></TR
></TABLE
></LI
></OL
></DIV
></DIV
><DIV
CLASS="sect2"
><HR><H2
CLASS="sect2"
><A
NAME="realnetboot"
></A
>4.3.6. Effectively booting from network</H2
><DIV
CLASS="highlights"
><A
NAME="AEN1272"
></A
><P
>&#13;					To conclude with the developers' way to boot the
					kernel, this section will tell you how to actually boot your
					system from a network server. But it tends to be less and less used.
					Most users will prefer to stick to <A
HREF="#boothd"
>Section 4.2</A
> once
					their system is properly setup.
				</P
></DIV
><P
>&#13;					Here we are. We assume that you've done everything outlined
					above, your network boot server is on the same physical subnet as
					your PA-RISC machine, you've got a bootable PA/Linux kernel lifimage
					on your boot server, and you're willing to give it a try.
					If everything is ready (including you!), the following procedure
					will introduce you to the joy of network booting your PA box into Linux.
				</P
><P
></P
><OL
TYPE="1"
><LI
><P
>Fire up your PA-RISC system.</P
></LI
><LI
><P
>&#13;							Watch your PA-RISC box starting up. When the following message
							appears during the PA-RISC machine's boot process, press
							and hold the <B
CLASS="keycap"
>Esc</B
> key:

					  	<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;Searching for Potential Boot Devices.
To terminate search, press and hold the ESCAPE key.
							</PRE
></FONT
></TD
></TR
></TABLE
>
						</P
></LI
><LI
><P
>&#13;							If needed, select '<TT
CLASS="computeroutput"
>a)  Enter Boot Administration
							mode</TT
>' from the menu.  This brings up the
							'<TT
CLASS="computeroutput"
>BOOT_ADMIN&#62;</TT
>' prompt.
						</P
></LI
><LI
><P
>&#13;							Type the following at the prompt: <B
CLASS="command"
>boot lan</B
>.
						</P
></LI
><LI
><P
>&#13;							Watch your PA-RISC system magically becoming a PA/Linux system.
							Ta dah!
						</P
></LI
></OL
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;					Of course your are supposed to run only one boot server
					at a time on your network, in order to avoid conflicts...
				</P
></TD
></TR
></TABLE
></DIV
></DIV
></DIV
></DIV
><DIV
CLASS="chapter"
><HR><H1
><A
NAME="vmlinux"
></A
>Chapter 5. Building and installing a custom kernel</H1
><DIV
CLASS="highlights"
><A
NAME="AEN1296"
></A
><P
>&#13;			To build a Linux kernel, you need a compiler and the kernel source.
			The first element is not a trivial thing to find because it
			depends on how you want to build your kernel.
			The second is easier since it can be found at
			<A
HREF="http://cvs.parisc-linux.org/"
TARGET="_top"
> the official CVS site</A
>.
			First, we will discuss about <B
CLASS="command"
>GCC</B
> compiler.
			Then, the preparation of the build will be explained.
			The last paragraph will deal with the installation of this new kernel.
		</P
></DIV
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;			We will deal only with a kernel built without modules,
			to simplify the explanations.
		</P
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="sect1"
><HR><H1
CLASS="sect1"
><A
NAME="gcc"
></A
>5.1. GCC compiler</H1
><DIV
CLASS="highlights"
><A
NAME="AEN1304"
></A
><P
>&#13;				You can build the kernel directly on your own PA-RISC box (<EM
>self-hosted</EM
>
				or <EM
>native</EM
> build).
				But on old systems, you may prefer to use another - faster - non PA-RISC computer
				to compile your kernel (<EM
>cross-compilation</EM
>). We will see the
				two possibilities.
			</P
></DIV
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;				By the time version 1.0 of this howto was released, only gcc-3.0.X was able
				to build working kernels. There was a bug in more recent versions that made
				the box crash when network activity occurs. It should be fixed by now, so
				using the latest version of gcc should be fine. If ever the above mentioned
				bug occurs, you'll know what's wrong. Anyway, if you want to build
				any kernel after 2.6.12-rc3, you will need at least <B
CLASS="command"
>gcc-3.3</B
>.
			</P
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="sect2"
><HR><H2
CLASS="sect2"
><A
NAME="nativebuild"
></A
>5.1.1. Native build</H2
><P
>&#13;					Since Debian was the first distribution to support PA-RISC architecture,
					if you want to use the <EM
>Super Cow</EM
> powers,
					you need to have some basic knowledge about the Debian packaging system.
					We will explain here how to quickly get a gcc compiler ready on your PA-RISC box.
					If you are not using Debian, well, we're afraid we can't do much
					for you: you will have to transpose what is said below to your distribution.
					We will assume you know how to use 
				</P
><P
>&#13;					If you are using your own PA-RISC box, you only need the good old
					<B
CLASS="command"
>GCC</B
> compiler. You can install the required tools to build a
					kernel by issuing:
				</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;<TT
CLASS="prompt"
>[user@machine ~/dir]&#62;</TT
> <B
CLASS="command"
>apt-get</B
> <TT
CLASS="userinput"
><B
>install build-essential libncurses5-dev</B
></TT
>
				</PRE
></FONT
></TD
></TR
></TABLE
><P
>&#13;					Essentially, this will install everything you need to build a kernel
					(and even a bit more). This boils down to <B
CLASS="command"
>binutils</B
>,
					<B
CLASS="command"
>gcc</B
>, <B
CLASS="command"
>libc-dev</B
>, <B
CLASS="command"
>make</B
>,
					<B
CLASS="command"
>fileutils</B
> and <B
CLASS="command"
>libncurses5-dev</B
>.
				</P
><P
>When this is done, you can proceed to the kernel settings.</P
></DIV
><DIV
CLASS="sect2"
><HR><H2
CLASS="sect2"
><A
NAME="crosscompile"
></A
>5.1.2. Cross compiled build</H2
><P
>&#13;					In this kernel build method, everything depends on the architecture
					of your building machine. If you want to compile your own toolchain, there
					is a slightly out-of-date HOWTO (<A
HREF="#bibxc"
><SPAN
CLASS="abbrev"
>O'Donell 2002</SPAN
></A
>). Otherwise, we
					assume you can either find a cross-compiler package for your build host, or
					make one by yourself.
				</P
><DIV
CLASS="important"
><P
></P
><TABLE
CLASS="important"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/important.gif"
HSPACE="5"
ALT="Important"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;					As there is not yet a 64bit userspace on HP-PA, you have to cross-compile
					64bit kernel even if you are building on a 64bit PA-RISC box. You can get
					unofficial debs for hppa64 compilers and binutils by running for instance:
					<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;<TT
CLASS="prompt"
>[user@machine ~/dir]&#62;</TT
> <B
CLASS="command"
>apt-get</B
> <TT
CLASS="userinput"
><B
>install gcc-3.3-hppa64 binutils-hppa64</B
></TT
>
					</PRE
></FONT
></TD
></TR
></TABLE
>
					See the <A
HREF="http://www.parisc-linux.org/"
TARGET="_top"
>PA-RISC Linux Website</A
>
					for details.
				</P
></TD
></TR
></TABLE
></DIV
></DIV
></DIV
><DIV
CLASS="sect1"
><HR><H1
CLASS="sect1"
><A
NAME="kernelconf"
></A
>5.2. Kernel configuration</H1
><P
>&#13;				If you want to take advantage of the latest kernel improvements, we
				suggest you retrieve it from the official
				<A
HREF="http://cvs.parisc-linux.org/"
TARGET="_top"
>PA-RISC/Linux CVS</A
>.
				Please mind that the <EM
>vanilla</EM
> kernel that can
				be found at	<A
HREF="http://www.kernel.org/"
TARGET="_top"
>http://www.kernel.org/</A
>
				is generally out of sync with the above mentioned CVS kernel, and that
				snapshots of this kernel are available too, check the
				<A
HREF="http://cvs.parisc-linux.org/download/"
TARGET="_top"
>download area</A
>.
				In the following, we will focus on a fresh CVS tree.
			</P
><P
>&#13;				The best way to obtain appreciable performances is to get a well
				configured kernel. For the PA-RISC platform, <B
CLASS="command"
>make oldconfig</B
>
				is a kind of default setup. If you want to make your own kernel,
				the first step is to know what hardware you have. The best way to
				grab useful info is to look at your box and find a maximum of data
				(model name, partnumber, chipsets, and so on). If you have already
				booted your box, you can take a look at <B
CLASS="command"
>dmesg</B
>
				output. Then, go to the <A
HREF="http://hwdb.parisc-linux.org/"
TARGET="_top"
>official
				hardware database</A
> or to the
				<A
HREF="http://partsurfer.hp.com/"
TARGET="_top"
>HP partsurfer website</A
>.
			</P
><P
>&#13;					Once you know what is inside your box and what you want to do with it,
					just run <B
CLASS="command"
>make menuconfig</B
> or another config command.
			</P
><DIV
CLASS="sect2"
><HR><H2
CLASS="sect2"
><A
NAME="kernelconf24"
></A
>5.2.1. Configuring 2.4 kernels</H2
><DIV
CLASS="highlights"
><A
NAME="AEN1357"
></A
><P
>&#13;					Here is a brief list of architecture dependent menus for 2.4 kernels.
					You should take a look at them, to see if the values set match
					your hardware. Mind that 2.4 kernels are now considered <EM
>deprecated</EM
>
					anyway: you will not get community support for them.
				</P
></DIV
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;					Remember that <B
CLASS="command"
>make oldconfig</B
> is a
					good base to start with, since it works for almost any machine.
				</P
></TD
></TR
></TABLE
></DIV
><P
></P
><UL
><LI
><P
><EM
>Processor type</EM
> - indicates your CPU model</P
></LI
><LI
><P
><EM
>General options</EM
> - tells you what is going to be enabled in your kernel (U2/Uturn, USC/GSC/HSC, Lasi, Wax, Dino, LBA/Elroy, SuperIO)</P
></LI
><LI
><P
><EM
>Parallel port support</EM
> - enables/disables the Lasi/ASP parport</P
></LI
><LI
><P
><EM
>SCSI support</EM
> - check there for your SCSI chipset (Lasi, Zalon, NCR/SYM53C8XX or other)</P
></LI
><LI
><P
><EM
>Network device support</EM
> - is used to set your network card (Lasi, Tulip...)</P
></LI
><LI
><P
><EM
>Character devices</EM
> - defines your I/O capabilities (Lasi, Dino, MUX see <A
HREF="#MUX24"
>Section 5.2.1.3</A
>)</P
></LI
><LI
><P
><EM
>HIL Support</EM
> - useful if you have a HIL controller. See below <A
HREF="#HIL24"
>Section 5.2.1.1</A
>.</P
></LI
><LI
><P
><EM
>Console drivers</EM
> - is directly related to your console mode (STI console or STI framebuffer)</P
></LI
><LI
><P
><EM
>Sound</EM
> - enables/disables the Harmony driver</P
></LI
></UL
><P
>&#13;					As you can see, menus specifically concerned by PA-RISC hardware are not
					that numerous, but there are lots of dependencies between them. Now,
					you must configure the kernel accordingly to what you plan to use
					this box for. Here is a list of some menus you should be going
					through to configure additional functionalities you might want:
				</P
><P
></P
><UL
><LI
><P
>&#13;				  		<EM
>General setup</EM
> - is responsible for binary
				  		formats handled by the kernel. You need ELF, and can try SOM
				  		(support for HP/UX binaries. It *might* work with some static
				  		executables).
				  	</P
></LI
><LI
><P
>&#13;				  		<EM
>Block devices</EM
> - sets the ramdisk and loopback
				  		support. You probably won't use them.
				  	</P
></LI
><LI
><P
>&#13;				  		<EM
>ATA/IDE/MFM/RLL support</EM
> - You will need to
				  		check this to enable IDE. See <A
HREF="#IDE24"
>Section 5.2.1.4</A
>.
				  	</P
></LI
><LI
><P
>&#13;				  		<EM
>File Systems/Network File Systems</EM
> - is where
				  		to set EXT3 or NFS support.
				  	</P
></LI
><LI
><P
>&#13;				  		<EM
>USB support</EM
> - If you have enabled
				  		<EM
>SuperIO</EM
> and want USB, look here:
				  		<A
HREF="#USB24"
>Section 5.2.1.2</A
>.
				  	</P
></LI
></UL
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;					By the time this HOWTO was written, there was no floppy drive
					support; and what's more, it is not expected to ever be supported.
				</P
></TD
></TR
></TABLE
></DIV
><P
>&#13;					When you're done with it, save your kernel configuration.
					Everything is written in the <TT
CLASS="filename"
>.config</TT
> file.
					You should back it up because <B
CLASS="command"
>make distclean</B
>
					will remove it. At this stage, you can do
					<B
CLASS="command"
>make dep vmlinux</B
> and if everything goes fine,
					you will have a new kernel in a couple of minutes.
				</P
><P
>&#13;					Here follows brief information about specific hardware configurations.
				</P
><DIV
CLASS="sect3"
><HR><H3
CLASS="sect3"
><A
NAME="HIL24"
></A
>5.2.1.1. <SPAN
CLASS="acronym"
>HIL</SPAN
> Support in 2.4</H3
><P
>&#13;						Since <TT
CLASS="literal"
>kernel-2.4.18-pa45</TT
>, there is a full
						<SPAN
CLASS="acronym"
>HIL</SPAN
> support, for mice, tablets and keyboards.
						It is based on the <EM
>Linux Input Driver</EM
> model.
						See the <A
HREF="http://www.parisc-linux.org/faq/"
TARGET="_top"
>PA-RISC/Linux FAQ</A
>
						and the <A
HREF="http://lists.parisc-linux.org/pipermail/parisc-linux/2002-June/016757.html"
TARGET="_top"
>mail</A
>
						posted on the mailing list by <EM
>Helge Deller</EM
>.
						Here is how to configure it:
					</P
><P
></P
><OL
TYPE="1"
><LI
><P
>Make sure you have a 2.4.18-pa45 or higher kernel source.</P
></LI
><LI
><P
>&#13;								Look at your kernel configuration for the following options:
								<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;CONFIG_INPUT=y
CONFIG_INPUT_KEYBDEV=y
CONFIG_INPUT_MOUSEDEV=y
CONFIG_INPUT_MOUSEDEV_SCREEN_X=1024
CONFIG_INPUT_MOUSEDEV_SCREEN_Y=768
CONFIG_INPUT_EVDEV=y

CONFIG_INPUT_SERIO=y

CONFIG_HIL=y
CONFIG_HP_SDC=y
CONFIG_HIL_MLC=y
CONFIG_HP_SDC_MLC=y
CONFIG_HIL_KBD=y
CONFIG_HIL_PTR=y
								</PRE
></FONT
></TD
></TR
></TABLE
>

								<DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;									There is no more <TT
CLASS="literal"
>CONFIG_HIL_KBD_BASIC</TT
>.
								</P
></TD
></TR
></TABLE
></DIV
>
							</P
></LI
><LI
><P
>&#13;								On your target system, check that the following devices are available:

								<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;/dev/input/mice
/dev/input/mouseX
/dev/input/eventX
								</PRE
></FONT
></TD
></TR
></TABLE
>

								If they are not yet present, create them as <TT
CLASS="literal"
>root</TT
> by running:

								<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;<TT
CLASS="prompt"
>[user@machine ~/dir]&#62;</TT
> <B
CLASS="command"
>cd /dev; MAKEDEV input</B
>
								</PRE
></FONT
></TD
></TR
></TABLE
>
				    	</P
></LI
><LI
><P
>&#13;								Configure <B
CLASS="command"
>gpm</B
> with the following
								options in <TT
CLASS="filename"
>/etc/gpm.conf</TT
>:

								<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;device=/dev/input/mice
type=imps2
								</PRE
></FONT
></TD
></TR
></TABLE
>
				    	</P
></LI
><LI
><P
>&#13;								Here is a sample <TT
CLASS="filename"
>/etc/X11/XF86Config-4</TT
>:

								<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;Section "InputDevice"
		Identifier      "HIL Keyboard"
		Driver          "keyboard"
		Option          "CoreKeyboard"
EndSection
Section "InputDevice"
		Identifier      "HIL Mouse"
		Driver          "mouse"
		Option          "CorePointer"
		Option          "Device"                "/dev/input/mice"
		Option          "Protocol"              "ImPS/2"
		Option          "ZAxisMapping"          "4 5"
EndSection
Section "ServerLayout"
		Identifier      "Default Layout"
		Screen          "Default Screen"
		InputDevice     "HIL Keyboard"
		InputDevice     "HIL Mouse"
EndSection
								</PRE
></FONT
></TD
></TR
></TABLE
>

								You can also download a sample <TT
CLASS="filename"
>XF86Config-4</TT
> here:
								<A
HREF="ftp://ftp.parisc-linux.org/XFree86/XF86Config-4"
TARGET="_top"
>ftp://ftp.parisc-linux.org/XFree86/XF86Config-4</A
>,
								adjust color depth and resolution, and put it in your
								<TT
CLASS="filename"
>/etc/X11/</TT
>.
							</P
></LI
></OL
></DIV
><DIV
CLASS="sect3"
><HR><H3
CLASS="sect3"
><A
NAME="USB24"
></A
>5.2.1.2. <SPAN
CLASS="acronym"
>USB</SPAN
> Support in 2.4</H3
><P
>&#13;						<SPAN
CLASS="acronym"
>USB</SPAN
> support on HP-PA is still experimental, therefore it is
						only configured as modules in default kernel configuration.
						We have tried to install a B2000 with builtin <SPAN
CLASS="acronym"
>USB</SPAN
> support,
						both 32 and 64bit, and it worked fine, despite some keyboard problems.
						Don't worry, nothing critical: the range of keys located between
						the main part of the keyboard (the letters, backspace, enter...)
						and the numeric pad are broken. They do not behave at all as expected.
					</P
><DIV
CLASS="tip"
><P
></P
><TABLE
CLASS="tip"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/tip.gif"
HSPACE="5"
ALT="Tip"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;						You can use the numeric pad as arrow keys: when <B
CLASS="keycap"
>NumLock</B
>
						is not activated, it behaves as a navigation pad. <EM
>e.g.</EM
>
						<B
CLASS="keycap"
>8</B
> is <B
CLASS="keycap"
>Up Arrow</B
>, <B
CLASS="keycap"
>4</B
> is
						<B
CLASS="keycap"
>Left Arrow</B
> and so on.
					</P
></TD
></TR
></TABLE
></DIV
><P
></P
><OL
TYPE="1"
><LI
><P
>Make sure you have a 2.4.18 or higher kernel source.</P
></LI
><LI
><P
>&#13;								Look at your kernel configuration for the following options:

								<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;CONFIG_SUPERIO=y
CONFIG_HOTPLUG=y

CONFIG_INPUT=y
CONFIG_INPUT_KEYBDEV=y
CONFIG_INPUT_MOUSEDEV=y
CONFIG_INPUT_MOUSEDEV_SCREEN_X=1024
CONFIG_INPUT_MOUSEDEV_SCREEN_Y=768
CONFIG_INPUT_EVDEV=y

CONFIG_USB=y
CONFIG_USB_DEVICEFS=y
CONFIG_USB_OHCI=y
CONFIG_HID=y
								</PRE
></FONT
></TD
></TR
></TABLE
>
							</P
></LI
><LI
><P
>&#13;								On your target system, check that the following devices
								are available:

								<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;/dev/input/mice
/dev/input/mouseX
/dev/input/eventX
								</PRE
></FONT
></TD
></TR
></TABLE
>

								If they are not yet present, create them as <TT
CLASS="literal"
>root</TT
> by running:

								<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;<TT
CLASS="prompt"
>[user@machine ~/dir]&#62;</TT
> <B
CLASS="command"
>cd /dev; MAKEDEV input</B
>
								</PRE
></FONT
></TD
></TR
></TABLE
>
							</P
></LI
><LI
><P
>&#13;								Configure <B
CLASS="command"
>gpm</B
> with the following options
								in <TT
CLASS="filename"
>/etc/gpm.conf</TT
>:

								<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;device=/dev/input/mice
type=imps2
								</PRE
></FONT
></TD
></TR
></TABLE
>
							</P
></LI
><LI
><P
>&#13;								The XF86-Config-4 is similar to the
								<TT
CLASS="literal"
>HIL</TT
> one, as it is also using the <EM
>Linux
								Input Driver</EM
>.
							</P
></LI
></OL
></DIV
><DIV
CLASS="sect3"
><HR><H3
CLASS="sect3"
><A
NAME="MUX24"
></A
>5.2.1.3. <SPAN
CLASS="acronym"
>MUX</SPAN
> Console Support in 2.4</H3
><P
>&#13;						<TT
CLASS="literal"
>MUX Console</TT
> has been improved by
						<EM
>Richard Hirst</EM
> in 2.4.18-pa37 kernel,
						though it is still a very <EM
>experimental</EM
> feature.
						It is expected to provide adequate <TT
CLASS="literal"
>MUX Console</TT
>
						support to <TT
CLASS="literal"
>E-</TT
> and <TT
CLASS="literal"
>K-Class</TT
> machines.
						Feedback would be really appreciated.
					</P
><P
>Now follow these steps to get it to work:</P
><P
></P
><OL
TYPE="1"
><LI
><P
>&#13;								Make sure you have a 2.4.18-pa37 or higher kernel source.
							</P
></LI
><LI
><P
>&#13;								Look at your kernel configuration for the following options:

								<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;CONFIG_SERIAL_CONSOLE=y

CONFIG_SERIAL_GSC=y

CONFIG_SERIAL_NONSTANDARD=y
CONFIG_SERIAL_MUX=y
								</PRE
></FONT
></TD
></TR
></TABLE
>
							</P
></LI
><LI
><P
>&#13;								On your target system, check that the following devices are available:

								<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;/dev/ttyB0
								</PRE
></FONT
></TD
></TR
></TABLE
>

								If they are not yet present, create them as <TT
CLASS="literal"
>root</TT
> by running:

								<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;<TT
CLASS="prompt"
>[user@machine ~/dir]&#62;</TT
> <B
CLASS="command"
>cd /dev; MAKEDEV ttyB0</B
>
								</PRE
></FONT
></TD
></TR
></TABLE
>

								<DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;									It needs a recent <TT
CLASS="literal"
>MAKEDEV</TT
> package to be
									created this way.
								</P
></TD
></TR
></TABLE
></DIV
>
							</P
></LI
><LI
><P
>&#13;								Now you can boot your system, taking care that <B
CLASS="command"
>PALO</B
> uses
								<TT
CLASS="computeroutput"
>console=ttyB0</TT
>.
							</P
></LI
></OL
></DIV
><DIV
CLASS="sect3"
><HR><H3
CLASS="sect3"
><A
NAME="IDE24"
></A
>5.2.1.4. <SPAN
CLASS="acronym"
>IDE</SPAN
> Devices Support in 2.4</H3
><P
>&#13;						There is nothing really special about <SPAN
CLASS="acronym"
>IDE</SPAN
>
						support. You have to check that the <EM
>IDE Chipset</EM
>
						in use in your box is supported by the kernel. A common chipset
						found on PA-RISC hardware is <TT
CLASS="literal"
>NS87415</TT
>.
						You can find it on B2000, J5000 and C3000 for instance. You will
						need <SPAN
CLASS="acronym"
>IDE</SPAN
> support to use some CD-ROM devices.
					</P
><P
>&#13;						Here is an example to get <SPAN
CLASS="acronym"
>IDE</SPAN
> to work with this chipset:
					</P
><P
></P
><OL
TYPE="1"
><LI
><P
>Make sure you have a recent kernel source.</P
></LI
><LI
><P
>&#13;								Look at your kernel configuration for the following options:

								<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;CONFIG_IOMMU_CCIO=y
CONFIG_PCI=y
CONFIG_PCI_LBA=y
CONFIG_IOSAPIC=y
CONFIG_IOMMU_SBA=y
CONFIG_SUPERIO=y

CONFIG_IDE=y

CONFIG_BLK_DEV_IDE=y

CONFIG_BLK_DEV_IDEPCI=y
CONFIG_BLK_DEV_IDEDMA=y
CONFIG_BLK_DEV_ADMA=y
CONFIG_BLK_DEV_IDEDMA=y
CONFIG_BLK_DEV_NS87415=y
								</PRE
></FONT
></TD
></TR
></TABLE
>
							</P
></LI
><LI
><P
>&#13;								On your target system, check that the following devices
								are available:

								<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;/dev/hd*
								</PRE
></FONT
></TD
></TR
></TABLE
>

								If they are not yet present, create them as <TT
CLASS="literal"
>root</TT
> by running:

								<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;<TT
CLASS="prompt"
>[user@machine ~/dir]&#62;</TT
> <B
CLASS="command"
>cd /dev; MAKEDEV hda hdb hdc hdd hde</B
>
								</PRE
></FONT
></TD
></TR
></TABLE
>
							</P
></LI
></OL
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;						Of course we didn't mention much of the architecture
						independent options. Moreover, the above settings may vary depending
						on your hardware. This is just an example.
					</P
></TD
></TR
></TABLE
></DIV
></DIV
></DIV
><DIV
CLASS="sect2"
><HR><H2
CLASS="sect2"
><A
NAME="kernelconf26"
></A
>5.2.2. Configuring 2.6 kernels</H2
><DIV
CLASS="highlights"
><A
NAME="AEN1552"
></A
><P
>&#13;					Here is a brief list of architecture dependent menus for 2.6 kernels.
					You should take a look at them, to see if the values set match
					your hardware:
				</P
></DIV
><P
></P
><UL
><LI
><P
><EM
>Processor type and features</EM
> - indicates your CPU model
						and some specific features such as SMP or Discontigmem support</P
></LI
><LI
><P
><EM
>Bus options</EM
> - tells you what bus support is going to be
						enabled in your kernel (U2/Uturn, USC/GSC/HSC, Lasi, Wax, Dino, LBA/Elroy, SuperIO)</P
></LI
><LI
><P
><EM
>PA-RISC specific drivers</EM
> - enables/disables some PA-RISC specific
						drivers, such as LED support, GSP and Stable Storage support.</P
></LI
></UL
><P
>&#13;					As you can see, menus specifically concerned by PA-RISC hardware are not
					that numerous, and everything else is much generic by now. Still,
					you must configure the kernel accordingly to what you plan to use
					this box for and what features you want supported. Many other drivers are found in
					their respective submenus, such as SCSI, with the Zalon, Lasi SCSI and SYM2 drivers being
					there, or the Framebuffer devices (STI) in the Graphics Support menu, or the sound drivers
					(Harmony and AD1889) in the Sound menu. Help is often provided, feel free to look at it.
				</P
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;					Most of what was said for 2.4 is somewhat still applicable to 2.6.
				</P
></TD
></TR
></TABLE
></DIV
></DIV
></DIV
><DIV
CLASS="sect1"
><HR><H1
CLASS="sect1"
><A
NAME="kernelinstall"
></A
>5.3. Kernel installation</H1
><P
>&#13;				If you have made a native build on the box you wish to install, you can setup
				the new kernel as follows:
				within the kernel source tree <TT
CLASS="filename"
>linux/</TT
>, as <TT
CLASS="literal"
>root</TT
> execute:

			  <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;<TT
CLASS="prompt"
>[user@machine ~/dir]&#62;</TT
> <B
CLASS="command"
>cp vmlinux /boot/vmlinux-<TT
CLASS="replaceable"
><I
>[kernelversion]</I
></TT
></B
>
<TT
CLASS="prompt"
>[user@machine ~/dir]&#62;</TT
> <B
CLASS="command"
>cp System.map /boot/System.map-<TT
CLASS="replaceable"
><I
>[kernelversion]</I
></TT
></B
>
<TT
CLASS="prompt"
>[user@machine ~/dir]&#62;</TT
> <B
CLASS="command"
>cp .config /boot/config-<TT
CLASS="replaceable"
><I
>[kernelversion]</I
></TT
></B
>
				</PRE
></FONT
></TD
></TR
></TABLE
>

				Though it is not mandatory, we suggest you to replace
				<TT
CLASS="replaceable"
><I
>[kernelversion]</I
></TT
> by the version of the
				kernel you built, <EM
>e.g.</EM
>:
				<TT
CLASS="filename"
>vmlinux-2.4.18-pa44</TT
>. This will help you
				dealing with multiple kernel versions on the same machine.
				The same applies to <TT
CLASS="filename"
>.config</TT
>.
				It is not needed to have a working kernel, though it might
				be very helpful when configuring a new one.
				Now, do <B
CLASS="command"
>cd /boot</B
>, make sure that
				<TT
CLASS="filename"
>vmlinux</TT
> is a symbolic link to another
				file, as in the following example:

			  <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;<TT
CLASS="prompt"
>[user@machine ~/dir]&#62;</TT
> <B
CLASS="command"
>ls -l vmlinux</B
>
<TT
CLASS="computeroutput"
>lrwxrwxrwx  1 root   root   35 Jun 23 01:38 vmlinux -&#62; vmlinux-2.4.18-64-SMP</TT
>
				</PRE
></FONT
></TD
></TR
></TABLE
>

				Make sure to remember the name of the kernel actually running
				on your box if ever the new one won't work properly.
				You are now able to ask <B
CLASS="command"
>PALO</B
> to boot on it if needed
				(see <A
HREF="#palo"
>Chapter 3</A
> for more information).
				Now do the following:

			  <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;<TT
CLASS="prompt"
>[user@machine ~/dir]&#62;</TT
> <B
CLASS="command"
>rm -f vmlinux</B
>
<TT
CLASS="prompt"
>[user@machine ~/dir]&#62;</TT
> <B
CLASS="command"
>ln -s vmlinux-<TT
CLASS="replaceable"
><I
>[kernelversion]</I
></TT
> vmlinux</B
>
<TT
CLASS="prompt"
>[user@machine ~/dir]&#62;</TT
> <B
CLASS="command"
>sync</B
>
				</PRE
></FONT
></TD
></TR
></TABLE
>

				If you want to boot from network you can forget all this,
				as you will need to set <B
CLASS="command"
>PALO</B
> as explained in the
				<A
HREF="#paloappusage"
>Section 3.3</A
>, and run <B
CLASS="command"
>make palo</B
>
				to create the bootable <EM
>lifimage</EM
>.
			</P
><P
>&#13;				If you have made a cross-compiled build or built a kernel on a
				PA box which is not the one you wish to install,
				you have to find a way to put <TT
CLASS="filename"
>vmlinux</TT
>,
				<TT
CLASS="filename"
>System.map</TT
> and eventually <TT
CLASS="filename"
>.config</TT
>
				in <TT
CLASS="filename"
>/boot/</TT
> as mentioned before.
				You can use the network (like <B
CLASS="command"
>ftp</B
>)
				or a CD to do so, or even direct copy to the hard disk drive.
			</P
></DIV
></DIV
><DIV
CLASS="appendix"
><HR><H1
><A
NAME="win2kdhcp"
></A
>Appendix A. <SPAN
CLASS="trademark"
>Windows</SPAN
>&#8482; 2003 boot server howto</H1
><BLOCKQUOTE
CLASS="ABSTRACT"
><DIV
CLASS="abstract"
><A
NAME="AEN1615"
></A
><P
></P
><P
>&#13;				This appendix has been greatly contributed by <EM
>Jeremy Drake</EM
>.
				It describes the process of setting up a <SPAN
CLASS="trademark"
>Windows</SPAN
>&#8482; 2003 Server to serve boot requests
				for a PA/Linux box.
			</P
><P
></P
></DIV
></BLOCKQUOTE
><DIV
CLASS="sect1"
><HR><H1
CLASS="sect1"
><A
NAME="win2ksetupdhcp"
></A
>A.1. Setup the DHCP service</H1
><P
>&#13;				As for the UNIX/Linux based approach (discussed in <A
HREF="#bootnetwork"
>Section 4.3</A
>),
				you need to collect some information and data before setting everything up.
				First of all, you need the MAC address of your PA-RISC box.
				Please check <A
HREF="#getmac"
><B
CLASS="command"
>rboot</B
> preparation</A
> for details.
				You are going to need a <A
HREF="#glosslifimage"
><I
CLASS="glossterm"
>lifimage</I
></A
> file.
				Please read <A
HREF="#preparingnetboot"
>Section 4.3.1</A
>.
			</P
><P
>&#13;				Then, you have to enable DHCP service on your <SPAN
CLASS="trademark"
>Windows</SPAN
>&#8482; box.
				You can do that by going into the <EM
>Control Panel</EM
>,
				open <EM
>Add/Remove Programs</EM
>, select <EM
>Windows
				Components</EM
> and finally <EM
>Networking Services</EM
>.
				There, enable <EM
>Dynamic Host Configuration Protocol (DHCP)</EM
>.
			</P
><P
>&#13;				You need to configure the DHCP service now. Launch the DHCP admin tool by
				going into the <EM
>Control Panel</EM
>, open <EM
>Admin
				Tools</EM
> and select <EM
>DHCP</EM
>.

				<P
></P
><UL
><LI
><P
>Expand the server tree.</P
></LI
><LI
><P
>&#13;				  		Right click on
 							<SPAN
CLASS="guimenu"
>Reservations</SPAN
>-&gt;<SPAN
CLASS="guimenuitem"
>New	Reservation...</SPAN
>
						</P
></LI
><LI
><P
>&#13;							In <EM
>Reservation name</EM
>, put the workstation's host
							name. Enter an unused IP address. Enter the PA-RISC box' MAC address (no
							delimiters, just the hex number). Select <EM
>Both</EM
> for whether it
							should be bootp or dhcp. Click <EM
>Ok</EM
> to close this window.
				    </P
></LI
><LI
><P
>&#13;							Look for your newly created reservation at the bottom of the
							list under <EM
>Reservations</EM
> and click it.
				    </P
></LI
><LI
><P
>Right click on <EM
>Configure Options...</EM
></P
></LI
><LI
><P
>&#13;							It should have inherited your server's default
							options, so we won't cover setting router, dns, wins and lease length.
				    </P
></LI
><LI
><P
>&#13;							Scroll down the list of options to 066: <EM
>Boot
							Server Host Name</EM
>. Check the box next to option 066.
							Enter your tftp server's ip address, because IPL can't resolve hostnames.
				    </P
></LI
><LI
><P
>&#13;							Check option 067: <EM
>Bootfile Name</EM
> and
							enter the name of the lifimage. Generally, <EM
>lifimage</EM
>
							is a good choice here.
				    </P
></LI
><LI
><P
>Click <EM
>Ok</EM
> and your dhcp server is	ready!</P
></LI
></UL
>
			</P
></DIV
><DIV
CLASS="sect1"
><HR><H1
CLASS="sect1"
><A
NAME="win2ksetuptftp"
></A
>A.2. Get &#38; setup the TFTP server</H1
><P
>&#13;				To get the network boot process operational, you need the TFTP service that
				provides the basic file system at boot time. Get Tftpd from
				<A
HREF="http://tftpd32.jounin.net/"
TARGET="_top"
>http://tftpd32.jounin.net/</A
>.
				You must download the latest version in zip format. Unzip it and store it in
				your favorite place. Then, you must setup the monster.

				<P
></P
><UL
><LI
><P
>Run tftpd32.</P
></LI
><LI
><P
>Click the <EM
>Browse</EM
> button.</P
></LI
><LI
><P
>&#13;							Browse to where you put your lifimage, highlight
							it and click <EM
>Ok</EM
>.
						</P
></LI
><LI
><P
>&#13;							Make sure the IP address below the directory is
							the one you gave to your PA-RISC box.
						</P
></LI
><LI
><P
>&#13;							Let tftpd32 open. The tftp server only runs
							when the <SPAN
CLASS="acronym"
>GUI</SPAN
> is displayed.
						</P
></LI
></UL
>

				If you want to run it as a NT service, you have to download a
				<SPAN
CLASS="trademark"
>Microsoft</SPAN
>&#8482; program. Please refer to the
				<A
HREF="http://perso.wanadoo.fr/philippe.jounin/tftpd32.html#FAQ"
TARGET="_top"
>\
				Tftpd32 FAQ</A
>.
			</P
></DIV
><DIV
CLASS="sect1"
><HR><H1
CLASS="sect1"
><A
NAME="tryw2k"
></A
>A.3. Attempt to netboot</H1
><P
>&#13;				Now, you are fully set up to try to boot your PA-RISC box via network.
				You can follow the instructions in <A
HREF="#realnetboot"
>Section 4.3.6</A
>.
			</P
><P
>&#13;				If you have any trouble, start by looking at those points and then ask the
				<A
HREF="http://www.parisc-linux.org/mailing-lists/"
TARGET="_top"
>PA/Linux mailing list</A
>.

				<P
></P
><UL
><LI
><P
>&#13;							Settings on the DHCP server (verify the PA-RISC MAC address is correct).
						</P
></LI
><LI
><P
>&#13;							Your dhcp server is on the same physical network segment as the PA-RISC box.
				   	</P
></LI
><LI
><P
>The state of the network connection of the 2 boxes.</P
></LI
><LI
><P
>Try to tcpdump while you are booting the PA-RISC box over the lan.</P
></LI
></UL
>
			</P
></DIV
></DIV
><DIV
CLASS="appendix"
><HR><H1
><A
NAME="oldpalo"
></A
>Appendix B. Older <B
CLASS="command"
>PALO</B
> dumps</H1
><DIV
CLASS="sect1"
><H1
CLASS="sect1"
><A
NAME="oldpaloa500"
></A
>B.1. A500 Session dump using <B
CLASS="command"
>PALO</B
> 0.97</H1
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
>&#13;Main Menu: Enter command or menu &#62; bo scsi.5.0 ipl
Interact with IPL (Y, N, or Cancel)?&#62; y


Booting...
Boot IO Dependent Code (IODC) revision 1


HARD Booted.
palo ipl 0.97 root@c3k Tue Nov 27 14:51:48 MST 2001
Information: Boot device can't seek past 2Gb (ignore next error).
byteio_read: seekread() returned -1 expected 2048

Partition Start(MB) End(MB) Id Type
1               1      15   f0 Palo
2              16     503   82 swap
3             504    2887   83 ext2

PALO(F0) partition contains:
	0/vmlinux64 3990942 bytes @ 0x44000

Information: No console specified on kernel command line. This is normal.
PALO will choose the console currently  used by firmware (serial).
Current command line:
3/boot/vmlinux root=/dev/sda3 HOME=/ console=ttyS0 TERM=vt102
 0: 3/boot/vmlinux
 1: root=/dev/sda3
 2: HOME=/
 3: console=ttyS0
 4: TERM=vt102

Edit which field?
(or 'b' to boot with this command line)? 0
3/boot/vmlinux-2.4.17-pa3 initrd=0/root.bin
Current command line:
3/boot/vmlinux-2.4.17-pa3 initrd=root.bin root=/dev/sda3 HOME=/
										 console=ttyS0 TERM=vt102
 0: 3/boot/vmlinux-2.4.17-pa3
 1: initrd=0/root.bin
 2: root=/dev/sda3
 3: HOME=/
 4: console=ttyS0
 5: TERM=vt102


Edit which field?
(or 'b' to boot with this command line)? 1

Current command line:
3/boot/vmlinux-2.4.17-pa3  root=/dev/sda3 HOME=/ console=ttyS0 TERM=vt102
 0: 3/boot/vmlinux-2.4.17-pa3
 1: root=/dev/sda3
 2: HOME=/
 3: console=ttyS0
 4: TERM=vt102

Edit which field?
(or 'b' to boot with this command line)? b
				</PRE
></FONT
></TD
></TR
></TABLE
><P
>&#13;					<B
CLASS="command"
>PALO</B
> was first setup to boot the kernel file <TT
CLASS="filename"
>vmlinux</TT
>
					located on the third partition of the SCSI device ID 5 LUN 0.
					(We know this since we have asked <B
CLASS="command"
>BOOT_ADMIN</B
> to boot on this device).
					But we wanted another kernel this time.
					We have pressed the <B
CLASS="keycap"
>Enter</B
> key (to validate the default
					choice '<TT
CLASS="computeroutput"
>0</TT
>')
					and modified the text to match our needs, here
					<TT
CLASS="filename"
>vmlinux-2.4.17-pa3</TT
>. We have also
					added an <TT
CLASS="computeroutput"
>initrd=0/root.bin</TT
> argument
					to the command line. We have validated our changes
					by hitting the <B
CLASS="keycap"
>Enter</B
> key.
					Finally we have decided that we didn't want this
					additional argument, so we have selected it and erased it.
					At the end it asked again which field we wanted to edit, we
					just typed '<TT
CLASS="computeroutput"
>b</TT
>' instead
					of any number and hit <B
CLASS="keycap"
>Enter</B
> to boot our new kernel.
				</P
></DIV
></DIV
><DIV
CLASS="appendix"
><HR><H1
><A
NAME="contributors"
></A
>Appendix C. HOWTO contributors</H1
><P
>&#13;			The following people contributed or reviewed this HOWTO in one way or another.
		</P
><P
>For Deb's version:

			<P
></P
><UL
><LI
><P
>&#13;						David Alexander deVries
						<TT
CLASS="email"
>&#60;<A
HREF="mailto:adevries@thepuffingroup.com"
>adevries@thepuffingroup.com</A
>&#62;</TT
>
					</P
></LI
><LI
><P
>&#13;						Philip Imperial Schwan
						<TT
CLASS="email"
>&#60;<A
HREF="mailto:pschwan@thepuffingroup.com"
>pschwan@thepuffingroup.com</A
>&#62;</TT
>
					</P
></LI
></UL
>
		</P
><P
>For Thomas' versions:

			<P
></P
><UL
><LI
><P
>&#13;						Michael Damaschke
						<TT
CLASS="email"
>&#60;<A
HREF="mailto:sps01@uni-koeln.de"
>sps01@uni-koeln.de</A
>&#62;</TT
>
						Thanks for your example about <B
CLASS="command"
>PALO</B
>
					</P
></LI
><LI
><P
>&#13;						Helge Deller
						<TT
CLASS="email"
>&#60;<A
HREF="mailto:deller@gmx.de"
>deller@gmx.de</A
>&#62;</TT
>
					</P
></LI
><LI
><P
>&#13;						Jeremy Drake
						<TT
CLASS="email"
>&#60;<A
HREF="mailto:jeremyd@apptechsys.com"
>jeremyd@apptechsys.com</A
>&#62;</TT
>
						Thanks for your <SPAN
CLASS="trademark"
>Windows</SPAN
>&#8482; boot server howto
					</P
></LI
><LI
><P
>&#13;						Grant Grundler
						<TT
CLASS="email"
>&#60;<A
HREF="mailto:grundler@parisc-linux.org"
>grundler@parisc-linux.org</A
>&#62;</TT
>
					</P
></LI
><LI
><P
>&#13;						Richard Hirst
						<TT
CLASS="email"
>&#60;<A
HREF="mailto:rhirst@parisc-linux.org"
>rhirst@parisc-linux.org</A
>&#62;</TT
>
					</P
></LI
></UL
>
		</P
><P
>For Thibaut's versions:

			<P
></P
><UL
><LI
><P
>&#13;						Matthieu Delahaye
						<TT
CLASS="email"
>&#60;<A
HREF="mailto:delahaym@esiee.fr"
>delahaym@esiee.fr</A
>&#62;</TT
>
					</P
></LI
><LI
><P
>&#13;						Helge Deller
						<TT
CLASS="email"
>&#60;<A
HREF="mailto:deller@gmx.de"
>deller@gmx.de</A
>&#62;</TT
>
					</P
></LI
><LI
><P
>&#13;						Grant Grundler
						<TT
CLASS="email"
>&#60;<A
HREF="mailto:grundler@parisc-linux.org"
>grundler@parisc-linux.org</A
>&#62;</TT
>
					</P
></LI
><LI
><P
>&#13;						Richard Hirst
						<TT
CLASS="email"
>&#60;<A
HREF="mailto:rhirst@parisc-linux.org"
>rhirst@parisc-linux.org</A
>&#62;</TT
>
					</P
></LI
><LI
><P
>&#13;						Kyle McMartin
						<TT
CLASS="email"
>&#60;<A
HREF="mailto:kyle@mcmartin.ca"
>kyle@mcmartin.ca</A
>&#62;</TT
>
					</P
></LI
><LI
><P
>&#13;						Clement Moyroud
						<TT
CLASS="email"
>&#60;<A
HREF="mailto:moyroudc@esiee.fr"
>moyroudc@esiee.fr</A
>&#62;</TT
>
					</P
></LI
><LI
><P
>&#13;						Carlos O'Donnel
						<TT
CLASS="email"
>&#60;<A
HREF="mailto:carlos@systemhalted.org"
>carlos@systemhalted.org</A
>&#62;</TT
>
					</P
></LI
><LI
><P
>&#13;						Matthew Wilcox
						<TT
CLASS="email"
>&#60;<A
HREF="mailto:matthew@wil.cx"
>matthew@wil.cx</A
>&#62;</TT
>
					</P
></LI
></UL
>
		</P
></DIV
><DIV
CLASS="GLOSSARY"
><H1
><A
NAME="gloss"
></A
>Glossary</H1
><P
>&#13;			This is a brief glossary of the PA-RISC specific terminology.
			You can find a more detailed one at
			<A
HREF="http://www.parisc-linux.org/glossary/"
TARGET="_top"
>http://www.parisc-linux.org/glossary/</A
>.
		</P
><DL
><DT
><A
NAME="glossbch"
></A
><B
>Boot Console Handler (<SPAN
CLASS="acronym"
>BCH</SPAN
>)</B
></DT
><DD
><P
>&#13;					This is the early boot console available during boot up on most PA-RISC machines,
					provided by the <A
HREF="#glosspdc"
><I
CLASS="glossterm"
>Processor-Dependent Code (<SPAN
CLASS="acronym"
>PDC</SPAN
>)</I
></A
>.
				</P
><P
><EM
>See Also: </EM
><A
HREF="#glossbootadmin"
>BOOT_ADMIN</A
>.</P
></DD
><DT
><A
NAME="glossbootadmin"
></A
><B
>BOOT_ADMIN</B
></DT
><DD
><P
>&#13;					This a command line utility stored in the boot ROM of
					the PA box, which is used to configure the computer during early boot
					sequence. It is a part of the PA-RISC machine's firmware.
				</P
><P
><EM
>See Also: </EM
><A
HREF="#glossbch"
>Boot Console Handler (<SPAN
CLASS="acronym"
>BCH</SPAN
>)</A
>.</P
></DD
><DT
><A
NAME="glossgsp"
></A
><B
>Guardian Service Processor (<SPAN
CLASS="acronym"
>GSP</SPAN
>)</B
></DT
><DD
><P
>&#13;					The <SPAN
CLASS="acronym"
>GSP</SPAN
> is a console subsystem present
					on certain PA-RISC systems, which provides several features such as remote
					console, UPS management, system low level control.
				</P
></DD
><DT
><A
NAME="glosshpmc"
></A
><B
>High Priority Machine Check (<SPAN
CLASS="acronym"
>HPMC</SPAN
>)</B
></DT
><DD
><P
>&#13;					Fatal system error. <A
HREF="#glosspdc"
><I
CLASS="glossterm"
>Processor-Dependent Code (<SPAN
CLASS="acronym"
>PDC</SPAN
>)</I
></A
> saves machine state in the
					<A
HREF="#glosspim"
><I
CLASS="glossterm"
>Processor Internal Memory (<SPAN
CLASS="acronym"
>PIM</SPAN
>)</I
></A
>.
				</P
></DD
><DT
><A
NAME="glosshppa"
></A
><B
>Hewlett Packard Precision Architecture (<SPAN
CLASS="acronym"
>HP-PA</SPAN
>)</B
></DT
><DD
><P
>&#13;					'HP-PA' (sometimes '<EM
>hppa</EM
>') is the short
					way to refer to <EM
>HP PA-RISC</EM
> architecture. It's real meaning
					is: '<EM
>Hewlett Packard Precision Architecture</EM
>'. It
					is used for instance by	<A
HREF="http://www.debian.org/ports/hppa/"
TARGET="_top"
>Debian</A
>
					and <A
HREF="http://www.openbsd.org/hppa.html"
TARGET="_top"
>OpenBSD</A
> to point out
					their ports.
				</P
></DD
><DT
><A
NAME="glossipl"
></A
><B
>Initial Program Loader (<SPAN
CLASS="acronym"
>IPL</SPAN
>)</B
></DT
><DD
><P
>&#13;					It is the HP standardized system bootstrap responsible for
					loading the operating system's kernel on PA-RISC systems. It can be launched
					from the <B
CLASS="command"
>BOOT_ADMIN</B
>.
				</P
><P
><EM
>See Also: </EM
><A
HREF="#glossbootadmin"
>BOOT_ADMIN</A
>.</P
></DD
><DT
><A
NAME="glossisl"
></A
><B
>Initial System Loader (<SPAN
CLASS="acronym"
>ISL</SPAN
>)</B
></DT
><DD
><P
>ISL is the executable that brings you into <B
CLASS="command"
>BOOT_ADMIN</B
>.</P
><P
><EM
>See Also: </EM
><A
HREF="#glossipl"
>Initial Program Loader (<SPAN
CLASS="acronym"
>IPL</SPAN
>)</A
>.</P
></DD
><DT
><A
NAME="glosslif"
></A
><B
>Logical Interchange Format (<SPAN
CLASS="acronym"
>LIF</SPAN
>)</B
></DT
><DD
><P
>&#13;					This is a HP mass-storage format used for exchanging files
					among HP computer systems. It basically contains a header (identifying it
					as a LIF volume) and a directory of fixed size containing the files. The
					size of the directory is fixed when the volume is created, which explains
					many things about the way <B
CLASS="command"
>PALO</B
> works!
				</P
></DD
><DT
><A
NAME="glosslifimage"
></A
><B
>lifimage</B
></DT
><DD
><P
>&#13;					It is the name contraction of <EM
>LIF image</EM
>, which is
					indeed a file which format respects the <TT
CLASS="literal"
>LIF</TT
> standard.
					It can be seen as the equivalent of an <TT
CLASS="literal"
>ISO</TT
> file,
					having the <TT
CLASS="literal"
>LIF</TT
> format instead of <TT
CLASS="literal"
>ISO9660</TT
>.
				</P
><P
><EM
>See Also: </EM
><A
HREF="#glosslif"
>Logical Interchange Format (<SPAN
CLASS="acronym"
>LIF</SPAN
>)</A
>.</P
></DD
><DT
><A
NAME="glosslpmc"
></A
><B
>Low Priority Machine Check (<SPAN
CLASS="acronym"
>LPMC</SPAN
>)</B
></DT
><DD
><P
>Generally a recoverable system error.</P
><P
><EM
>See Also: </EM
><A
HREF="#glosshpmc"
>High Priority Machine Check (<SPAN
CLASS="acronym"
>HPMC</SPAN
>)</A
>.</P
></DD
><DT
><A
NAME="glossmp"
></A
><B
>Management Processor (<SPAN
CLASS="acronym"
>MP</SPAN
>)</B
></DT
><DD
><P
>&#13;					The <SPAN
CLASS="acronym"
>MP</SPAN
> is a newer evolution of the <SPAN
CLASS="acronym"
>GSP</SPAN
>.
				</P
><P
><EM
>See Also: </EM
><A
HREF="#glossgsp"
>Guardian Service Processor (<SPAN
CLASS="acronym"
>GSP</SPAN
>)</A
>.</P
></DD
><DT
><A
NAME="glossparisc"
></A
><B
><SPAN
CLASS="acronym"
>PA-RISC</SPAN
></B
></DT
><DD
><P
>&#13;					PA stands for Precision Architecture. It is the name of two
					generations of HP processors. They are classified as PA-RISC 1.X and PA-RISC 2.0.
					But a system based on a PA-RISC processor is commonly called a HP-PA box.
				</P
><P
><EM
>See Also: </EM
><A
HREF="#glosshppa"
>Hewlett Packard Precision Architecture (<SPAN
CLASS="acronym"
>HP-PA</SPAN
>)</A
>.</P
></DD
><DT
><A
NAME="glosspalo"
></A
><B
>PA LOader (<SPAN
CLASS="acronym"
>PALO</SPAN
>)</B
></DT
><DD
><P
>&#13;					<B
CLASS="command"
>PALO</B
> is the <EM
>PA/Linux kernel LOader</EM
>. It was
					designed by Paul Bame as a <EM
>LILO</EM
> equivalent for the PA-RISC
					architecture.
				</P
></DD
><DT
><A
NAME="glosspdc"
></A
><B
>Processor-Dependent Code (<SPAN
CLASS="acronym"
>PDC</SPAN
>)</B
></DT
><DD
><P
>&#13;					It is the firmware that handles all processor-dependent
					functionalities, including hardware initialization and self-test procedures.
					Once it has done this, it passes control to the ISL.
				</P
><P
><EM
>See Also: </EM
><A
HREF="#glossisl"
>Initial System Loader (<SPAN
CLASS="acronym"
>ISL</SPAN
>)</A
>.</P
></DD
><DT
><A
NAME="glosspim"
></A
><B
>Processor Internal Memory (<SPAN
CLASS="acronym"
>PIM</SPAN
>)</B
></DT
><DD
><P
>&#13;					Machine state is saved here after <A
HREF="#glosshpmc"
><I
CLASS="glossterm"
>High Priority Machine Check (<SPAN
CLASS="acronym"
>HPMC</SPAN
>)</I
></A
>,
					<A
HREF="#glosslpmc"
><I
CLASS="glossterm"
>Low Priority Machine Check (<SPAN
CLASS="acronym"
>LPMC</SPAN
>)</I
></A
>, and <A
HREF="#glosstoc"
><I
CLASS="glossterm"
>Transfer Of Control (<SPAN
CLASS="acronym"
>TOC</SPAN
>)</I
></A
>.
					See <TT
CLASS="literal"
>PDC_PIM</TT
> in "PDC Procedures" chapter of PA-RISC I/O ACD
					(available from <A
HREF="http://www.parisc-linux.org/documentation/"
TARGET="_top"
>&#13;					http://www.parisc-linux.org/documentation/</A
>.
				</P
><P
><EM
>See Also: </EM
><A
HREF="#glossisl"
>Initial System Loader (<SPAN
CLASS="acronym"
>ISL</SPAN
>)</A
>.</P
></DD
><DT
><A
NAME="glossnetinst"
></A
><B
>netinst</B
></DT
><DD
><P
>&#13;					This is not a PA-RISC specific term, though it needs
					explanations. <EM
>Network Install</EM
>, also known as
					<EM
>netinst</EM
>, are small ISOs containing everything you
					need to boot a computer and install it from network. They are based on
					the <A
HREF="http://www.debian.org/"
TARGET="_top"
>Debian distribution</A
>.
				</P
></DD
><DT
><A
NAME="glosssuckyio"
></A
><B
>SuckyIO</B
></DT
><DD
><P
>&#13;					<TT
CLASS="literal"
>(added by special request)</TT
> National
					Semiconductor PC87560UBD, aka <EM
>SuperIO</EM
>.
					Provides IDE, USB 1.1, Floppy Disk Controller, parallel port, 2 serial
					ports, UIR (Infrared), etc.  But since National denies the existence of
					this chip and HP was the only client for this buggy PoS,
					the name <EM
>SuckyIO</EM
> has stuck.
				</P
></DD
><DT
><A
NAME="glosssuperio"
></A
><B
>SuperIO</B
></DT
><DD
><P
>Official term for <EM
>SuckyIO</EM
>.</P
><P
><EM
>See Also: </EM
><A
HREF="#glosssuckyio"
>SuckyIO</A
>.</P
></DD
><DT
><A
NAME="glosssti"
></A
><B
>Standard Text Interface (<SPAN
CLASS="acronym"
>STI</SPAN
>)</B
></DT
><DD
><P
>&#13;					It defines a standardized way to access the graphic subsystem
					on HP-PA.
				</P
></DD
><DT
><A
NAME="glosssticon"
></A
><B
>Standard Text Interface Console layer (<SPAN
CLASS="acronym"
>STIcon</SPAN
>)</B
></DT
><DD
><P
>&#13;					It is the basic text-mode console that can run on top of any STI-capable device.
				</P
><P
><EM
>See Also: </EM
><A
HREF="#glosssti"
>Standard Text Interface (<SPAN
CLASS="acronym"
>STI</SPAN
>)</A
>.</P
></DD
><DT
><A
NAME="glossstifb"
></A
><B
>Standard Text Interface FrameBuffer layer (<SPAN
CLASS="acronym"
>STIfb</SPAN
>)</B
></DT
><DD
><P
>&#13;					It is a superset of STI, providing standard API to access framebuffer
					devices on HP-PA.
				</P
><P
><EM
>See Also: </EM
><A
HREF="#glosssti"
>Standard Text Interface (<SPAN
CLASS="acronym"
>STI</SPAN
>)</A
>.</P
></DD
><DT
><A
NAME="glosstoc"
></A
><B
>Transfer Of Control (<SPAN
CLASS="acronym"
>TOC</SPAN
>)</B
></DT
><DD
><P
>&#13;					This acronym can usually be found on some PA-RISC boxes, right near a tiny
					switch that is not often used (hopefully).
					On HP/UX it would make a crash dump and reset the box. It
					can also be requested from the <A
HREF="#glossgsp"
><I
CLASS="glossterm"
>Guardian Service Processor (<SPAN
CLASS="acronym"
>GSP</SPAN
>)</I
></A
>. On Linux,
					it will save the registers and reset, saved registers will be accessible
					in the <A
HREF="#glosspdc"
><I
CLASS="glossterm"
>Processor-Dependent Code (<SPAN
CLASS="acronym"
>PDC</SPAN
>)</I
></A
>.
				</P
></DD
></DL
></DIV
><A
NAME="biblio"
></A
><HR><H1
><A
NAME="biblio"
></A
>Bibliography</H1
><P
>&#13;			These documents might prove helpful to understand the present one,
			or to open new horizons:
		</P
><DIV
CLASS="biblioentry"
><A
NAME="bibinstall"
></A
><P
>[Raymond 2000]&nbsp;<SPAN
CLASS="AUTHOR"
>E. S. Raymond</SPAN
>, 2000, <I
>&#13;				<A
HREF="http://www.tldp.org/HOWTO/Installation-HOWTO/index.html"
TARGET="_top"
>Installation-HOWTO</A
>
		  </I
>.</P
><DIV
CLASS="BIBLIOENTRYBLOCK"
STYLE="margin-left: 0.5in"
><DIV
CLASS="abstract"
><P
>&#13;					How to obtain and install Linux software. It is the first
					document which a new Linux user should read to get started.
				</P
></DIV
></DIV
></DIV
><DIV
CLASS="biblioentry"
><A
NAME="bibnfsroot"
></A
><P
>[Maor 1999]&nbsp;<SPAN
CLASS="AUTHOR"
>O. Maor</SPAN
>, 1999, <I
>&#13;				<A
HREF="http://www.tldp.org/HOWTO/mini/NFS-Root-Client-mini-HOWTO/index.html"
TARGET="_top"
>NFS-Root-Client Mini-HOWTO</A
>
		  </I
>.</P
><DIV
CLASS="BIBLIOENTRYBLOCK"
STYLE="margin-left: 0.5in"
><DIV
CLASS="abstract"
><P
>&#13;						How to create client root directories on a server that is
						using NFS Root mounted clients.
					</P
></DIV
></DIV
></DIV
><DIV
CLASS="biblioentry"
><A
NAME="bibnfsdiskless"
></A
><P
>[Kostyrka 1997]&nbsp;<SPAN
CLASS="AUTHOR"
>A. Kostyrka</SPAN
>, 1997, <I
>&#13;				<A
HREF="http://www.tldp.org/HOWTO/mini/NFS-Root.html"
TARGET="_top"
>NFS-Root Mini-HOWTO</A
>
		  </I
>.</P
><DIV
CLASS="BIBLIOENTRYBLOCK"
STYLE="margin-left: 0.5in"
><DIV
CLASS="abstract"
><P
>&#13;					How to setup a 'disk-less' Linux workstation, which mounts
					its root filesystem <EM
>via</EM
> NFS.
				</P
></DIV
></DIV
></DIV
><DIV
CLASS="biblioentry"
><A
NAME="bibdisk"
></A
><P
>[Harris et al. 1997]&nbsp;<SPAN
CLASS="AUTHOR"
>T. Harris </SPAN
><SPAN
CLASS="AUTHOR"
>and K. Koehntopp</SPAN
>, 1997, <I
>&#13;				<A
HREF="http://www.tldp.org/HOWTO/mini/Partition/index.html"
TARGET="_top"
>Linux Partition HOWTO</A
>
		  </I
>.</P
><DIV
CLASS="BIBLIOENTRYBLOCK"
STYLE="margin-left: 0.5in"
><DIV
CLASS="abstract"
><P
>&#13;					Teaches you how to plan and layout disk space for your
					Linux system.
				</P
></DIV
></DIV
></DIV
><DIV
CLASS="biblioentry"
><A
NAME="bibcvs"
></A
><P
>[Dev 1998]&nbsp;<SPAN
CLASS="AUTHOR"
>A. Dev</SPAN
>, 1998, <I
>&#13;				<A
HREF="http://www.tldp.org/HOWTO/CVS-RCS-HOWTO.html"
TARGET="_top"
>CVS-RCS-HOWTO</A
>
		  </I
>.</P
><DIV
CLASS="BIBLIOENTRYBLOCK"
STYLE="margin-left: 0.5in"
><DIV
CLASS="abstract"
><P
>&#13;					This document is a "practical guide" to very
					quickly setup CVS/RCS source code control system.
				</P
></DIV
></DIV
></DIV
><DIV
CLASS="biblioentry"
><A
NAME="bibapt"
></A
><P
>[Noronha Silva 2001]&nbsp;<SPAN
CLASS="AUTHOR"
>G. Noronha Silva</SPAN
>, 2001, <I
>&#13;				<A
HREF="http://www.debian.org/doc/manuals/apt-howto/"
TARGET="_top"
>APT HOWTO</A
>
		  </I
>.</P
><DIV
CLASS="BIBLIOENTRYBLOCK"
STYLE="margin-left: 0.5in"
><DIV
CLASS="abstract"
><P
>&#13;					Will help you understand how the Debian package management
					utility, APT, works.
				</P
></DIV
></DIV
></DIV
><DIV
CLASS="biblioentry"
><A
NAME="bibxc"
></A
><P
>[O'Donell 2002]&nbsp;<SPAN
CLASS="AUTHOR"
>C. O'Donell</SPAN
>, 2002, <I
>&#13;				<A
HREF="http://www.parisc-linux.org/toolchain/PARISC-Linux-XC-HOWTO.html"
TARGET="_top"
>The PARISC-Linux Cross Compiler HOWTO</A
>
		  </I
>.</P
><DIV
CLASS="BIBLIOENTRYBLOCK"
STYLE="margin-left: 0.5in"
><DIV
CLASS="abstract"
><P
>&#13;					This is a semi-detailed guide for building a cross
					compiler toolchain targeting PA-RISC systems.
				</P
></DIV
></DIV
></DIV
><DIV
CLASS="biblioentry"
><A
NAME="bibhp"
></A
><P
>[Cornec 1997]&nbsp;<SPAN
CLASS="AUTHOR"
>B. Cornec</SPAN
>, 1997, <I
>&#13;				<A
HREF="http://www.tldp.org/HOWTO/HP-HOWTO/index.html"
TARGET="_top"
>HP HOWTO</A
>
		  </I
>.</P
><DIV
CLASS="BIBLIOENTRYBLOCK"
STYLE="margin-left: 0.5in"
><DIV
CLASS="abstract"
><P
>&#13;					Describes the use of products available in the
					Hewlett-Packard (HP) catalog with Linux and some free software.
				</P
></DIV
></DIV
></DIV
><DIV
CLASS="biblioentry"
><A
NAME="bibdebian"
></A
><P
>[Perens et al. 1996]&nbsp;<SPAN
CLASS="AUTHOR"
>B. Perens, </SPAN
><SPAN
CLASS="AUTHOR"
>S. Rudolph, </SPAN
><SPAN
CLASS="AUTHOR"
>I. Grobman, </SPAN
><SPAN
CLASS="AUTHOR"
>J. Treacy, </SPAN
><SPAN
CLASS="AUTHOR"
>and A. Di Carlo</SPAN
>, 1996, <I
>&#13;				<A
HREF="http://ftp.debian.org/debian/dists/woody/main/disks-hppa/current/doc/index.en.html"
TARGET="_top"
>Debian GNU/Linux 3.0 Installation Documentation Index</A
>
		  </I
>.</P
><DIV
CLASS="BIBLIOENTRYBLOCK"
STYLE="margin-left: 0.5in"
><DIV
CLASS="abstract"
><P
>&#13;					Will help you to install and configure your Debian
					GNU/Linux system.
				</P
></DIV
></DIV
></DIV
><DIV
CLASS="biblioentry"
><A
NAME="bibdebiansarge"
></A
><P
>[Debian Installer Team 2005]&nbsp;<SPAN
CLASS="AUTHOR"
>Debian Installer Team</SPAN
>, 2004, 2005, <I
>&#13;				<A
HREF="http://www.debian.org/releases/sarge/hppa/"
TARGET="_top"
>Debian GNU/Linux 3.1 Installation Documentation</A
>
		  </I
>.</P
><DIV
CLASS="BIBLIOENTRYBLOCK"
STYLE="margin-left: 0.5in"
><DIV
CLASS="abstract"
><P
>&#13;					Will help you to install and configure your Debian Sarge
					GNU/Linux system.
				</P
></DIV
></DIV
></DIV
><DIV
CLASS="biblioentry"
><A
NAME="bibgentoo"
></A
><P
>[Vermeulen et al. 2006]&nbsp;<SPAN
CLASS="AUTHOR"
>S. Vermeulen, </SPAN
><SPAN
CLASS="AUTHOR"
>R. Marples, </SPAN
><SPAN
CLASS="AUTHOR"
>D. Robbins, </SPAN
><SPAN
CLASS="AUTHOR"
>C. Houser, </SPAN
><SPAN
CLASS="AUTHOR"
>and J. Alexandratos</SPAN
>, 2006, <I
>&#13;				<A
HREF="http://www.gentoo.org/doc/en/handbook/handbook-hppa.xml"
TARGET="_top"
>Gentoo HPPA Handbook</A
>
		  </I
>.</P
><DIV
CLASS="BIBLIOENTRYBLOCK"
STYLE="margin-left: 0.5in"
><DIV
CLASS="abstract"
><P
>&#13;					A must read for the wannabe Gentoo user.
				</P
></DIV
></DIV
></DIV
><DIV
CLASS="biblioentry"
><A
NAME="bibkeyb"
></A
><P
>[Brouwer 1993]&nbsp;<SPAN
CLASS="AUTHOR"
>A. Brouwer</SPAN
>, 1993, <I
>&#13;				<A
HREF="http://www.tldp.org/HOWTO/Keyboard-and-Console-HOWTO.html"
TARGET="_top"
>The Linux keyboard and console HOWTO</A
>
		  </I
>.</P
><DIV
CLASS="BIBLIOENTRYBLOCK"
STYLE="margin-left: 0.5in"
><DIV
CLASS="abstract"
><P
>&#13;					This note contains some information about the Linux
					keyboard and console, and the use of non-ASCII characters.
				</P
></DIV
></DIV
></DIV
><DIV
CLASS="biblioentry"
><A
NAME="bibhpboot"
></A
><P
>[HP Booting]&nbsp;<I
>&#13;				<A
HREF="http://docs.hp.com/en/B2355-90950/ch05s01.html"
TARGET="_top"
>HP documentation: Booting Systems</A
>
		  </I
>.</P
><DIV
CLASS="BIBLIOENTRYBLOCK"
STYLE="margin-left: 0.5in"
><DIV
CLASS="abstract"
><P
>&#13;					This is an HP document detailing booting procedures.
				</P
></DIV
></DIV
></DIV
></DIV
><H3
CLASS="FOOTNOTES"
>Notes</H3
><TABLE
BORDER="0"
CLASS="FOOTNOTES"
WIDTH="100%"
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN123"
HREF="#AEN123"
><SPAN
CLASS="footnote"
>[1]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>Before the first release of Debian on hppa,
			there has been unofficial releases of Woody snapshots, entitled "PA/Linux releases",
			and numbered <EM
>0.x</EM
>. Immediately after the release of Woody,
			the PA/Linux port switched to the normal Debian numbering scheme. In other words,
			Debian 3.0 is consecutive to PA/Linux 0.9.3.</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN546"
HREF="#AEN546"
><SPAN
CLASS="footnote"
>[2]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>For the knowledge addict:
				<B
CLASS="command"
>PALO</B
> can actually access and read ext2/ext3 filesystem, and therefore follow symlinks,
				whereas <SPAN
CLASS="application"
>LILO</SPAN
> bootloader will only know the physical
				disk address to	access the kernel. See
				<A
HREF="http://home.att.net/~lilo-boot/lbuild.htm"
TARGET="_top"
>this</A
>
				for further details.</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.kpath"
HREF="#kpath"
><SPAN
CLASS="footnote"
>[3]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>Example: /boot is mounted from a separate partition,
								which number is, say, 4 according to <B
CLASS="command"
>fdisk</B
>.
								From a Linux point of view, the absolute path of the file is
								<TT
CLASS="filename"
>/boot/vmlinux</TT
>, but from a <EM
>partition</EM
>
								point of view, it is <TT
CLASS="filename"
>/vmlinux</TT
>. Therefore,
								the commandline will start with "<TT
CLASS="literal"
>4/vmlinux</TT
>".
								We hope that's clear enough!</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN825"
HREF="#AEN825"
><SPAN
CLASS="footnote"
>[4]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>The
						<TT
CLASS="parameter"
><I
>format-as</I
></TT
> switch is a bit misleading. When used with
						<TT
CLASS="parameter"
><I
>init-partitioned</I
></TT
> it is meant to tell which filesystem to format
						the new partition, but with <TT
CLASS="parameter"
><I
>update-partitioned</I
></TT
>, it is meant to
						tell <B
CLASS="command"
>PALO</B
> which filesystem is used on the already formatted partition.</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN853"
HREF="#AEN853"
><SPAN
CLASS="footnote"
>[5]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>&#13;						To save your changes, you will have to run <B
CLASS="command"
>/sbin/palo</B
>
						when your system will be up and running,
						and it will write on the disk all the parameters contained in
						the configuration file, (<TT
CLASS="filename"
>/etc/palo.conf</TT
>), which
						you will have properly modified if needed.</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN906"
HREF="#AEN906"
><SPAN
CLASS="footnote"
>[6]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>For those who wonder what the final
						0 means, it's the device LUN. Since most SCSI devices have only
						one LUN (especially disks), you can safely use 0 as in this
						example.</P
></TD
></TR
></TABLE
></BODY
></HTML
>